export default [
	{
		category: "技术",
		books: [
			{
				cover: "/books/Redis4.xCookbook中文版.jpg",
				name: "Redis 4.x Cookbook中文版",
				link: "https://www.amazon.cn/dp/B07F2GGTWS/ref=sr_1_1",
				description: "通过本书讲述的Redis在设计、开发和运维等方面的80多个实战案例，读者不仅可以由浅入深地学习到有关Redis的几乎所有知识，还可以将案例中所讲解的内容直接用于包括设计、开发和运维等在内的各类生产实践。"
			},
			{
				cover: "/books/RabbitMQ实战指南.jpg",
				name: "RabbitMQ实战指南",
				link: "https://www.amazon.cn/dp/B077MQC3KM/ref=sr_1_1",
				description: "本书从消息中间件的概念和RabbitMQ的历史切入，主要阐述RabbitMQ的安装、使用、配置、管理、运维、原理、扩展等方面的细节。"
			}
		]
	},
	{
		category: "人文社科",
		books: [
			{
				cover: "/books/十亿消费者.jpg",
				name: "十亿消费者",
				link: "http://mebook.cc/9552.html",
				description: "中国经济飞速发展国力愈来愈强大，面对10亿消费者这个巨大的市场，世界各地的竞争者不断涌入，中国市场俨然已经成为竞争最激烈的全球市场。"
			},
			{
				cover: "/books/番茄工作法图解.jpg",
				name: "番茄工作法图解",
				link: "https://www.amazon.cn/dp/B004O9F71K/ref=sr_1_1",
				description: "作者根据亲身运用番茄工作法的经历，以生动的语言，传神的图画，将番茄工作法的具体理论和实践呈现在读者面前。"
			},
			{
				cover: "/books/清醒思考的艺术.jpg",
				name: "清醒思考的艺术",
				link: "https://www.amazon.cn/dp/B01HLRFFU4/ref=sr_1_2",
				description: "《清醒思考的艺术》不仅指陈思考错误，更提出有效对抗妙招，预防掉入隐形思考陷阱，让你看清思考盲点，清除决策障碍，选对思考方法，做出正确选择。每个思考错误搭配一幅风格独特的插画，实用性与娱乐性兼具。"
			},
			{
				cover: "/books/明智行动的艺术.jpg",
				name: "明智行动的艺术",
				link: "https://www.amazon.cn/dp/B01J0MH2BI/ref=sr_1_1",
				description: "《明智行动的艺术》以机智风趣的语调，以及清晰恳切的陈述，融合了经济、管理、心理学等各学科的前沿智慧，并运用哈佛大学、斯坦福大学、普林斯顿大学、伯克利大学等的前沿研究成果，为我们剖析和纠正行为上的偏误。"
			},
			{
				cover: '/books/乌合之众：群体时代的大众心理.jpg',
				name: '乌合之众：群体时代的大众心理',
				link: 'https://www.amazon.cn/dp/B07JC9NC99/ref=sr_1_6',
				description: '《乌合之众：群体时代的大众心理》为群体心理学奠基之作。《乌合之众：群体时代的大众心理》深入浅出地剖析了群体的种种特点及其成因，深入透视了社会服从和过度服从、群众的反叛、大众文化、受别人支配的自我、群众运动、人的自我异化、官僚化过程以及无意识在社会行为中的作用。'
			}
		]
	},
	{
		category: "小说",
		books: [
			{
				cover: "/books/解忧杂货铺.jpg",
				name: "解忧杂货铺",
				link: "https://www.amazon.cn/dp/B00JZ96ZI8/ref=tmm_hrd_swatch_0?_encoding=UTF8&qid=1561727949&sr=8-12",
				description: "东野圭吾最受欢迎作品：不是推理小说，却更扣人心弦。街上有一家神奇的杂货店，这里既卖些杂货，还提供解决烦恼的点子——如果你有什么烦恼，就写下来，投进门口的信箱，一个美美的答案第二天就在店后的牛奶箱等你。"
			},
			{
				cover: "/books/刺杀骑士团长.jpg",
				name: "刺杀骑士团长",
				link: "https://www.amazon.cn/dp/B079FLYB49/ref=tmm_pap_swatch_0",
				description: "《刺杀骑士团长》是村上春树七年磨一剑的突破之作。一幅藏匿于阁楼的惊世画作串起战争年代挥之不去的伤痛经历和现实生活中超脱想象的意外离奇。夜半铃声与古庙洞口、神秘邻居免色涉与绘画班女学生秋川真理惠、“骑士团长”与“长面人”、现实世界与隐喻世界……"
			},
			{
				cover: "/books/白夜行.jpg",
				name: "白夜行",
				link: "https://www.amazon.cn/dp/B00ARB0HBO/ref=tmm_hrd_swatch_0?_encoding=UTF8&qid=1561727949&sr=8-1",
				type: "推理",
				description: "多年以前，一个男子遭利器刺死于废弃房子中，案件没有头绪，始终未能破解。此后二十年间，由此案滋生出的恶与绝望，逐渐萌芽生长，绽放出恶之花，男女主角将越来越多的人笼罩进杀戮的阴影之中。"
			},
			{
				cover: "/books/虚无的十字架.jpg",
				name: "虚无的十字架",
				link: "https://www.amazon.cn/dp/B00YOBMT6E/ref=tmm_hrd_swatch_0?_encoding=UTF8&qid=1561727949&sr=8-6",
				type: "推理",
				description: "《虚无的十字架》充分展现了东野圭吾的创作才华。东野圭吾这次选择的，是社会道德议题上一个两难的选择：关于罪与罚，是让犯人听到自己的死刑宣判而感到解脱？还是让他重返自由社会用尽一生赎罪？这正是东野圭吾想要展现的力量：现代社会关于死刑是否应该被废除的一次深刻的思考和解读。"
			},
			{
				cover: "/books/三体全集.jpg",
				name: "三体全集",
				link: "https://www.amazon.cn/dp/B00OB3SNMY/ref=sr_1_1",
				type: "科幻",
				description: `《三体1》<br>
				军方探寻外星文明的绝秘计划“红岸工程”取得了突破性进展。但在按下发射键的那一刻，历经劫难的叶文洁没有意识到，她彻底改变了人类的命运。<br>
				地球文明向宇宙发出的一声啼鸣，以太阳为中心，以光速向宇宙深处飞驰……四光年外的“三体文明”百余次毁灭与重生，正被逼迫不得不逃离母星，而恰在此时，他们接收到了地球发来的信息。<br>
				庞大的三体舰队开始向地球进发，人类的末日悄然来临……<br>
				《三体2·黑暗森林》<br>
				庞大的三体舰队杀气腾腾直扑太阳系，被尖端科技锁死的地球人面对前所未有的危局，组建起同样庞大的太空舰队，同时行星防御理事会（PDC）利用三体人一个致命的缺陷，制订了“面壁计划”。<br>
				在这场你死我活的文明生存竞争中，罗辑探索出了宇宙文明间的黑暗森林法则，暂时使地球与三体建立起脆弱的战略平衡。<br>
				在这样脆弱的关系中，宇宙就是一座黑暗森林，每个文明都是带枪的猎人。<br>
				猎捕即将开始……<br>
				《三体3·死神永生》<br>
				身患绝症的云天明买下一颗星星送给暗恋着的大学同学程心，而程心因参与向三体舰队发射探测器的工作，让云天明作为被执行人将大脑捐献给阶梯计划。<br>
				云天明被送去三体后，向程心透露了大量的情报；人类自以为悟出了生存竞争的秘密，开始进行掩体计划……<br>
				在地球人类接近灭亡之际，程心在云天明送的一颗行星上，遇到了关一帆，且探讨了宇宙降维的真相……<br>
				掩体计划的背后到底隐藏着什么阴谋？降维的真相又揭示了怎样的宇宙？<br>
				宇宙的零点，即将进入倒计时......`
			}
		]
	},
	{
    category: "阿加莎·克里斯蒂 作品",
    books: [
			{
				cover: "/books/无人生还.jpg",
				name: "无人生还",
				link: "https://www.amazon.cn/dp/B00E9KKX72/ref=sr_1_2",
				type: "推理",
				description: "十个相互陌生、身份各异的人受邀前往德文郡海岸边一座孤岛上的豪宅。客人到齐后，主人却没有出现。当晚，一个神秘的声音发出指控，分别说出每个人心中罪恶的秘密。接着，一位客人离奇死亡。暴风雨让小岛与世隔绝，《十个小士兵》——这首古老的童谣成了死亡咒语。如同歌谣中所预言的，客人一个接一个死去……杀人游戏结束后，竟无一人生还！"
			},
			{
				cover: "/books/悬崖上的谋杀.jpg",
				name: "悬崖上的谋杀",
				link: "https://www.amazon.cn/dp/B07RQWP5KV/ref=sr_1_13",
				type: "推理",
				description: "博比·琼斯是个不着调的年轻人。一天，他在高尔夫球场发现有人跌落悬崖，赶过去时此人已经奄奄一息，挣扎着在死前留下了一句莫名其妙的话：“他们干嘛不找埃文斯呢？” 博比没有多想，却在事后遭人谋杀未遂。回过神来，他的生活俨然成了一本刺激的侦探小说：危机暗藏的田园生活，新开的精神疗养院，邪恶的医生，吸食毒品的丈夫，角落里的丑闻……"
			},
			{
				cover: "/books/奉命谋杀.jpg",
				name: "奉命谋杀",
				link: "https://www.amazon.cn/dp/B0721V9FP2/ref=sr_1_1",
				type: "推理",
				description: "卡尔加里博士在傍晚时分突然造访居住在艳阳角的阿盖尔一家，带来一个消息：涉嫌谋杀母亲并被定罪、最终惨死监狱中的小儿子杰克是被冤枉的。博士本人可以证实他的不在场证明。然而这迟来的正义却让一家人茫然，甚至惊恐。卡尔加里博士大惑不解，他觉得这个家里藏着些秘密。时至今日还能查出陈年旧案的真凶吗？而查出真凶真的是此事最好的解决方式吗……"
			},
			{
				cover: "/books/长夜.jpg",
				name: "长夜",
				link: "https://www.amazon.cn/dp/B00T238N9Q/ref=pd_sim_351_58",
				type: "推理",
				description: "长夜——美丽宁静的吉卜赛庄，却被传言是一所遭受了诅咒的住所，许多擅自进入的人都会在事故中丧生，没有人能够逃脱。然而英俊潇洒的穷小子迈克还是一眼看中了这里，奢望成为这里的主人。他与富家小姐艾丽在这里相遇、相爱，不久后便结婚、定居。他相信自己已经拥有了世界上最美好的一切，可那可怕的诅咒会放过他们吗？有一天，艾丽骑马出去，再也没有回来……"
			},
    ]
	}
]