export default {
  load() {
    return [
      {
        timestamp: '案件开端',
        title: '悬崖边的死亡谜题',
        type: 'danger',
        data: {
          '地点': '威尔士海滨悬崖',
          '事件': '博比打高尔夫时发现一名坠崖男子，临终前留下谜题：“他们为什么不找埃文斯？”'
        }
      },
      {
        timestamp: '案发后不久',
        title: '博比遭遇谋杀未遂',
        data: {
          '地点': '村庄及周边',
          '事件': '博比因知晓遗言被人下毒，侥幸生还后意识到案件不简单，决定调查。'
        }
      },
      {
        timestamp: '博比康复后',
        title: '弗兰基加入调查',
        data: {
          '地点': '德温特家族庄园',
          '事件': '弗兰基凭借贵族身份介入案件，两人发现死者与巴辛顿-弗伦奇家族有关联。'
        }
      },
      {
        timestamp: '调查中期',
        title: '精神疗养院的秘密',
        data: {
          '地点': '尼科尔森医生的疗养院',
          '事件': '博比和弗兰基潜入疗养院，发现莫伊拉被控制，并揭露非法药物实验。'
        }
      },
      {
        timestamp: '线索追踪期',
        title: '凯曼夫妇的骗局',
        data: {
          '地点': '旅馆及社交场合',
          '事件': '两人识破凯曼夫妇伪装成死者亲属的阴谋，获取关键证据。'
        }
      },
      {
        timestamp: '调查高潮',
        title: '罗杰的真实面目',
        data: {
          '地点': '巴辛顿-弗伦奇家族宅邸',
          '事件': '揭露罗杰与谋杀案的关联，其动机涉及遗产争夺和家族丑闻。'
        }
      },
      {
        timestamp: '结局前夕',
        title: '埃文斯的真相',
        data: {
          '地点': '乡村隐蔽处',
          '事件': '找到埃文斯，其证言揭示死者身份及谋杀动机，指向一场精心策划的阴谋。'
        }
      },
      {
        timestamp: '案件收尾',
        title: '最终对决与真相',
        data: {
          '地点': '悬崖附近',
          '事件': '凶手试图灭口，博比和弗兰基凭借机智脱险，警方介入，真相大白。'
        }
      }
    ]
  }
}