export default {
  load() {
    return [
      {
        text: '科幻',
        items: [
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/80/yuewen_695233/t6_yuewen_6952331677562148.jpg",
            "text": "三体（全集）",
            "link": "https://weread.qq.com/web/bookDetail/ce032b305a9bc1ce0b0dd2a?",
            "description": "刘慈欣<br>每个人的书架上都该有套《三体》！关于宇宙最狂野的想象！就是它！征服世界的中国科幻神作！包揽九项世界顶级科幻大奖！出版16个语种，横扫30国读者！奥巴马、雷军、马化腾、周鸿袆、潘石屹、扎克伯格……强推！刘慈欣获得2018年度克拉克想象力贡献社会奖！刘慈欣是中国科幻小说的最主要代表作家，亚洲首位世界科幻大奖“雨果奖”得主，被誉为中国科幻的领军人物。"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/88/YueWen_25504039/t6_YueWen_25504039.jpg",
            "text": "三体前传：球状闪电",
            "link": "https://weread.qq.com/web/bookDetail/6b832220718529276b89a0a?",
            "description": "刘慈欣<br>没有《球状闪电》，就没有后来的《三体》！《三体》前传！亚洲首位雨果奖得主刘慈欣的三大长篇之一！（《三体》《球状闪电》《超新星纪元》）《球状闪电》拥有最狂野的想象力！带你从另一个维度观察世界！全面展现刘慈欣对人生的终极思考！《三体》中解决可控核聚变的顶级物理学家丁仪，正是《球状闪电》中找到球状闪电的关键人物。《三体》中一号面壁人的幽灵军队计划，正是来自于《球状闪电》。《球状闪电》中的疑似宇宙观察者，为《三体》中的智子出现铺陈了线索。《球状闪电》和《三体》是刘慈欣两个不同时期的巅峰之作，《球状闪电》是他对人生的终极思考，《三体》则是他对宇宙的终极思考。过一个美妙的人生并不难，关键在于你迷上的是什么。某个离奇的雨夜，一颗球状闪电在一瞬间将少年的父母化为灰烬，而他们身下的板凳却分毫无损。从此少年踏上了研究球状闪电的旅程，死亡者的幽灵笔迹、前苏联的地下科技城、次世代的世界大战……球状闪电意外成为了战争中决定祖国存亡的终极武器！一个从未有人想像过的未来，在宇宙观察者的注视下，悄然降临在人类面前……"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/387/25135387/t6_25135387.jpg",
            "text": "流浪地球",
            "link": "https://weread.qq.com/web/bookDetail/4db32510717f891b4dbdaca?",
            "description": "刘慈欣<br>刘慈欣的短篇小说构思巧妙，想象力纵横恣肆，将坚实的科学基础以及厚重的人文关怀隐藏在灵动精致的故事结构中。本集精选出刘慈欣的十一篇短篇小说，其中《朝闻道》《流浪地球》《乡村教师》《中国太阳》《全频带阻塞干扰》均获银河奖。《流浪地球》《乡村教师》已被改编为电影。《带上她的眼睛》入选人教版七年级下学期《语文》教材。本书封面插画为《流浪地球》同名电影海报。"
          },
        ]
      },
      {
        text: '推理小说女王 - 阿加莎.克里斯蒂 作品集',
        items: [
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/63/yuewen_728514/t6_yuewen_7285141680854106.jpg",
            "text": "无人生还（同名英剧原著）",
            "link": "https://weread.qq.com/web/bookDetail/d6332fd05b1dc2d63df8938?",
            "description": "阿加莎·克里斯蒂<br>十个相互陌生、身份各异的人受邀前往德文郡海岸边一座孤岛上的豪宅。客人到齐后，主人却没有出现。当晚，一个神秘的声音发出指控，分别说出每个人心中罪恶的秘密。接着，一位客人离奇死亡。暴风雨让小岛与世隔绝，《十个小士兵》——这首古老的童谣成了死亡咒语。如同歌谣中所预言的，客人一个接一个死去……杀人游戏结束后，竟无一人生还！"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/92/yuewen_728522/t6_yuewen_7285221680854077.jpg",
            "text": "罗杰疑案",
            "link": "https://weread.qq.com/web/bookDetail/2ce329305b1dca2ceb95926?",
            "description": "阿加莎·克里斯蒂<br>金斯艾伯特村里坐落着两座豪宅，“皇家围场”是其中之一，而居住其中的弗拉尔斯太太刚刚过世。此后不久，她的情人，也就是住在另一所大宅里的罗杰·艾克罗伊德先生便得知，弗拉尔斯太太一年前杀害了自己的丈夫，最终因愧疚而自杀。更重要的是，罗杰还发现她在死之前一直被一个神秘人敲诈。他展开她最后的来信，打算读出那个人的名字，可惜没有人听到。因为一把短剑插进了他的后颈……"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/53/yuewen_728497/t6_yuewen_7284971680854100.jpg",
            "text": "东方快车谋杀案",
            "link": "https://weread.qq.com/web/bookDetail/603327a05b1db160313dacf?",
            "description": "阿加莎·克里斯蒂<br>11月10日，《东方快车谋杀案》时隔43年再度被搬上大银幕，肯尼思·布拉纳、佩内洛普·克鲁兹、威廉·达福 、朱迪·丹奇、约翰尼·德普等众多顶级演员出演。1974年，英格丽·褒曼凭借本书改编的同名电影获得奥斯卡奖，英国女王出席该片首映礼。本书以1932年轰动一时的真实案件“林白之子绑架案”为蓝本，淋漓极致展现了作者刻画人物群像的深厚功力。侦探波洛在叙利亚完成了一项委托，要搭乘辛普朗号东方快车回国。奇怪的是，似乎全世界的人都选在那一夜出行，这列铺位一向宽裕的豪华列车竟然一票难求。幸好他遇到了好友、国际客车公司的董事布克先生，这才挤上了车。午夜过后，一场大雪迫使辛普朗号停了下来。第二天一早，大家发现少了一名乘客。一个美国人死在了他的包厢里，被刺了十二刀，可他包厢的门却是反锁的。随着调查的深入，案情却似乎更加扑朔迷离，大侦探波洛想出了两种截然不同的解释……"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/508/728508/t6_728508.jpg",
            "text": "尼罗河上的惨案",
            "link": "https://weread.qq.com/web/bookDetail/07c321b05b1dbc07cdb1288?",
            "description": "阿加莎·克里斯蒂<br>琳内特·里奇卫拥有一切——年轻、美貌、过人的头脑，而且还继承了巨额财产。但出乎所有人的意料，她闪电般地与自己的地产经纪人，也就是好友杰奎琳的男友多伊尔结了婚。婚后幸福的二人决定去埃及度蜜月。决意复仇的杰奎琳、偷偷在琳内特财产上做了手脚的律师，以及其他许多似乎是外人的游客，与他们登上了同一条船。"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/37/yuewen_728509/t6_yuewen_7285091680854028.jpg",
            "text": "帷幕",
            "link": "https://weread.qq.com/web/bookDetail/3a4328105b1dbd3a43d7b54?",
            "description": "阿加莎·克里斯蒂<br>波洛与挚友黑斯廷斯的探案生涯回到了原点，他们再次相聚于斯泰尔斯庄园——正是在这里，初到英国的波洛解决了第一起谋杀案。"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/93/YueWen_22289907/t6_YueWen_22289907.jpg",
            "text": "牙医谋杀案",
            "link": "https://weread.qq.com/web/bookDetail/4be3229071541df34bea4eb?",
            "description": "阿加莎·克里斯蒂<br>一，二，扣住鞋；三，四，关紧门；五，六，衔树枝；七，八，理顺它；九，十，肥母鸡；十一，十二，深探究；十三，十四，女求偶；十五，十六，厨娘们；十七，十八，在等待；十九，二十，终散席。看牙医是种怎样恐怖的体验？大侦探波洛在前往莫利医生的诊所做牙科检查时，他的自信心一度降到了零。没料到，数小时后莫利医生在诊室里自杀身亡。为何一名牙医会在一个繁忙的工作日里选择自杀？一只鞋的鞋扣成为破案的关键。现在，诚如童谣所说，波洛能挑拣出有用的树枝，把它们筑成一个鸟巢吗？"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/98/YueWen_24058391/t6_YueWen_24058391.jpg",
            "text": "三幕悲剧",
            "link": "https://weread.qq.com/web/bookDetail/869322a0716f1a178694449?",
            "description": "阿加莎·克里斯蒂<br>一向镇定自若的赫尔克里·波洛正面临侦探生涯中最难解的案件——犯罪动机？不存在。毒物？不知所终。萨特思韦特先生——那位人生舞台上的旁观者再次出现，抢走了伟大侦探的不少风头。一个不知天高地厚的天真少女，两位温文尔雅的年长绅士，三名毫无关联的无辜死者。相似的戏码交替上演，悲剧从一场注定变成诅咒的十三人晚宴开始，徐徐拉开序幕……"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/51/yuewen_728495/t6_yuewen_7284951680854085.jpg",
            "text": "ABC谋杀案",
            "link": "https://weread.qq.com/web/bookDetail/d0f328105b1dafd0f419a10?",
            "description": "阿加莎·克里斯蒂<br>“那就让我们看看，聪明的波洛先生到底有多聪明。”化名ABC的连环杀人狂按照列车时刻表的字母顺序，一步步实施杀人计划。他狂妄地向波洛发出挑战书，整个英国因此陷入恐慌。A：安德沃尔，B：贝克斯希尔，C：彻斯顿……每成功犯下一条命案，凶手就更为自信，而波洛，似乎总是迟到了一步。"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/881/22289881/t6_22289881.jpg",
            "text": "阿加莎·克里斯蒂自传",
            "link": "https://weread.qq.com/web/bookDetail/f1b3296071541dd9f1b2ce4?",
            "description": "阿加莎·克里斯蒂<br>全世界都知道她是侦探小说女王，熟识她笔下的名侦探、有趣的故事，以及曾神秘失踪两星期。而身为善于描绘的作家，她如何讲述自己的一生？作为女性：从淘气儿童到魅力少女，从女儿妹妹到妻子母亲，从对爱失望到重获幸福。阿加莎那些优雅的建议如今听来依旧时髦、实用。作为作家：从兴趣爱好到职业，作品渐渐畅销，并开创新的创作领域。阿加莎对立志入此行的年轻人的教诲句句发自肺腑。作为旅行爱好者：与爱人周游世界，独自踏入东方，不同心境的阿加莎开出超个性攻略。作为一个英国人：经历两次世界大战的阿加莎，对祖国怀有深情的守护、对战争心怀入骨的憎恨。读过她的书，再认识这个人。"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/62/yuewen_728513/t6_yuewen_7285131680853813.jpg",
            "text": "斯泰尔斯庄园奇案",
            "link": "https://weread.qq.com/web/bookDetail/41332ae05b1dc14139fb29d?",
            "description": "阿加莎·克里斯蒂<br>斯泰尔斯庄园的女主人英格尔索普太太掌管着财政大权。某日凌晨，她在自己的房间里毒发身亡，而房间的三个门都是从里面锁上的。侦探波洛在调查此案的过程中发现了一系列疑点，但最大的疑犯——英格尔索普太太的丈夫却有不在场的证据。最让波洛感到头痛的是，庄园里的每个人似乎都隐瞒了什么。"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/499/728499/t6_728499.jpg",
            "text": "五只小猪",
            "link": "https://weread.qq.com/web/bookDetail/b8232f905b1db3b82bfeccd?",
            "description": "阿加莎·克里斯蒂<br>年轻的卡拉小姐在结婚前夕被告知自己的身世——十六年前她的父亲被杀，而她的母亲被当做杀人凶手死在狱中。大为震惊的同时，她也收到了母亲临死前留给她的信，信中坚称自己不是凶手。困惑的卡拉找到波洛，希望查明真相。波洛走访了五位当年的见证人，从他们的叙述中还原出了一幅耐人寻味的画卷……"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/15/YueWen_24139770/t6_YueWen_24139770.jpg",
            "text": "清洁女工之死",
            "link": "https://weread.qq.com/web/bookDetail/7ab32880717057fa7ab0cfe?",
            "description": "阿加莎·克里斯蒂<br>清洁女工麦金蒂太太毫无征兆地离奇被害。凶手残忍地敲碎了她的后脑勺。性格古怪的房客詹姆斯·本特利立即成为了疑点最大的嫌疑犯。他的衣服上粘有被害人的血迹和头发。然而，经验丰富的斯彭斯警监并不认为他是杀人凶手。真相能否从命案发生两天前的一张剪报中找到？绝命杀手依然逍遥法外。伟大的侦探赫尔克里·波洛必须提防种种不测，拼出这幅凌乱的拼图，以找出真凶……"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/19/YueWen_24139774/t6_YueWen_24139774.jpg",
            "text": "死亡草",
            "link": "https://weread.qq.com/web/bookDetail/10332b80717057fe1037168?",
            "description": "阿加莎·克里斯蒂<br>神舍前高举双臂的美艳女祭司，密室中预示厄运的蓝色报春花，石板路上突然出现的血迹，自称能占卜未来的神秘通灵师，离奇消失的遗嘱，被嫉妒和占有欲支配的死亡之草……星期二晚间俱乐部的成员们围坐在一起，轮流讲述发生在自己身边的谜案，只有亲爱的马普尔小姐每次都能直指真相。"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/527/728527/t6_728527.jpg",
            "text": "阳光下的罪恶（同名电影原著）",
            "link": "https://weread.qq.com/web/bookDetail/810321205b1dcf81096b6d1?",
            "description": "阿加莎·克里斯蒂<br>阿加莎·克里斯蒂编著的《阳光下的罪恶（阿加莎·克里斯蒂作品）》讲述了这样一个故事，艾莲娜·马歇尔太太是海盗旗旅馆中最令人瞩目的客人。在众多仰慕者中，她很快和英俊的帕特里克·雷德芬如胶似漆。雷德芬太太为此伤心愤怒，马歇尔先生却不动声色。好戏刚刚开幕，艾莲娜却失踪了，直到人们发现她美丽的躯体被遗弃在已经没有阳光的海滩上，脖子上留下了可怕的手印……"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/59/yuewen_728510/t6_yuewen_7285101680854092.jpg",
            "text": "底牌",
            "link": "https://weread.qq.com/web/bookDetail/98132de05b1dbe981cd7f85?",
            "description": "阿加莎·克里斯蒂<br>著名富商夏塔纳先生邀请波洛参加一次特殊的私人聚会，同时还邀请了另外三位侦探，包括著名的侦探小说作家、苏格兰场的警司与政府密探。与此同时，到场的还有夏塔纳要展示的特别的收藏：四位完美的凶手。"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/512/728512/t6_728512.jpg",
            "text": "悬崖山庄奇案",
            "link": "https://weread.qq.com/web/bookDetail/fb8329105b1dc0fb8e09c59?",
            "description": "阿加莎·克里斯蒂<br>山崖上的古宅拥有一位年轻漂亮的主人：尼克·巴克利小姐。她热爱这幢祖屋，然而当她住在这里时却怪事频发，威胁到她的生命。她床头的油画莫名其妙地掉落，车子刹车突然失灵，走在小路上也差点被巨石砸中……"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/62/YueWen_728528/t6_YueWen_728528.jpg",
            "text": "高尔夫球场命案",
            "link": "https://weread.qq.com/web/bookDetail/e75329a05b1dd0e75f5b32c?",
            "description": "阿加莎·克里斯蒂<br>一封求救信让波洛来到了法国，然而他来得太迟了，因为他的委托人已经被人用裁纸刀刺死，面朝下躺在一座高尔夫球场上的墓穴中。为什么死者身上的大衣长出了一大截？大衣口袋里那封热情洋溢的情书又是写给谁的？波洛还没有来得及弄清楚这些问题，第二具尸体又以同样的方式出现了……"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/182/732182/t6_732182.jpg",
            "text": "沉默的证人",
            "link": "https://weread.qq.com/web/bookDetail/376323905b2c163768ffdec?",
            "description": "阿加莎·克里斯蒂<br>年迈富有的阿伦德尔小姐从楼梯上跌了下来。每个人都把事故原因归咎于小狗鲍勃留在楼梯顶层的皮球，可是阿伦德尔小姐越想越觉得不对劲儿，她相信这不是一起意外，而是某个血亲试图谋杀她。阿伦德尔小姐把自己的怀疑写下来寄给波洛。这封语焉不详的信马上引起了波洛的兴趣，但他永远失去了这位委托人，因为阿伦德尔小姐已经去世了……"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/879/22289879/t6_22289879.jpg",
            "text": "H庄园的午餐",
            "link": "https://weread.qq.com/web/bookDetail/4d132e7071541dd74d17518?",
            "description": "阿加莎·克里斯蒂<br>年轻美丽的埃莉诺·卡莱尔平静地站在被告席上。她是H庄园女主人韦尔曼太太的侄女，被控谋杀了她的情敌——H庄园门房的女儿玛丽·杰拉德。证据确凿：埃莉诺准备了那份致命的午餐，也只有她拥有作案动机和时机。然而，在这个充满敌意的法庭上，只有一个人依然认为埃莉诺直到被证明有罪之前是清白的。赫尔克里·波洛挡在了埃莉诺和绞刑台之间……"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/95/yuewen_728525/t6_yuewen_7285251680854036.jpg",
            "text": "谋杀启事",
            "link": "https://weread.qq.com/web/bookDetail/34432bc05b1dcd344e8ff5e?",
            "description": "阿加莎·克里斯蒂<br>在一个平凡的小村镇，生活着一群普通的英国人。这个周五，百无聊赖的小镇居民纷纷被报上的一则谋杀启事吸引。它预告今天晚上，在老小姐莱蒂西亚家将有一场神秘的谋杀。傍晚时分，好奇的人们聚在女主人家。六点半的钟声响起，灯忽然熄灭。 “砰”、“砰”——“砰”，枪声响了。游戏结束，谋杀开始。"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/54/YueWen_728520/t6_YueWen_728520.jpg",
            "text": "破镜谋杀案",
            "link": "https://weread.qq.com/web/bookDetail/fc532f305b1dc8fc5b05c05?",
            "description": "阿加莎·克里斯蒂<br>美丽动人、在影视圈里风生水起大半辈子的大明星玛丽娜搬进了马普尔小姐所在的乡村小镇。风韵犹存的女明星举办盛大派对宴请小镇居民，每位来客都热情地上前攀谈，然而原本谈笑风生的女主人突然望着虚空中的一点，表情仿佛凝固了一般。这一奇异的画面被几位细心的客人捕捉到，事后众说纷纭，唯一相似的说法是，大家都觉得女主人那时如同看到了噩运。果然，不久后噩运降临，富丽堂换的女星豪宅迎来一连串凶杀……"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/642/852642/t6_852642.jpg",
            "text": "蒙面女人",
            "link": "https://weread.qq.com/web/bookDetail/638320d05d02a2638217a3f?",
            "description": "阿加莎·克里斯蒂<br>黑斯廷斯上尉认为，在波洛早期的侦探生涯中，有十八起案件值得拿出来与大家共赏。这些疑案花招百出：易容、诈骗、自编自导、嫁祸、双簧戏等等。不过，波洛依旧一副自信满满的模样，似乎天下没有他破不了的案子。“好好用用你那“小小的灰色细胞”，我的朋友，答案就在眼皮底下。”"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/29/YueWen_728516/t6_YueWen_728516.jpg",
            "text": "死亡约会",
            "link": "https://weread.qq.com/web/bookDetail/5f2320105b1dc45f21f5caf?",
            "description": "阿加莎·克里斯蒂<br>肥胖、邪恶的博因顿老夫人是家族的暴君。她就像一只盘踞在网中的蜘蛛，把几位儿女死死地困在身边，不让他们和外界接触，并以此为乐。每个人都对她厌憎无比，却又无力摆脱。古怪的博因顿一家来到约旦。炎热的一天，在佩特拉迷人的玫瑰色峭壁上，博因顿老夫人像尊怪异的佛像一般端坐不动——她死了。只是，她的手腕上留有一个微小的针孔，那是她被注射过致命一针的唯一迹象。这一次，留给波洛解谜的时间，只有二十四小时。"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/2/YueWen_852630/t6_YueWen_852630.jpg",
            "text": "波洛圣诞探案记",
            "link": "https://weread.qq.com/web/bookDetail/115323905d029611562436f?",
            "description": "阿加莎·克里斯蒂<br>对于自己在南非的发家之路以及手边留有一堆未经切割的钻石，老西米恩·李一直引以为傲，更不用说他哄起女人来确实有一手。可到了风烛残年的岁数，他在病痛中唯一想到的消遣方式，便是借着过圣诞节的机会，把四散各处的儿子们叫回身边，挨个儿数落。当然，他也没忘了提及修改遗嘱——挑起家人之间的猜忌是多么有趣的事！圣诞前夜，李家笼罩在不祥的气氛中，一声惨叫，老西米恩死在自己的卧室中。呈密室状态的现场，家里每个人都有作案的可能，面对如此棘手的案子，大侦探波洛也不得不度过一个并不轻松的圣诞节了……"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/3/yuewen_852653/t6_yuewen_8526531693465129.jpg",
            "text": "万圣节前夜的谋杀：电影《威尼斯惊魂夜》原著丨杨紫琼主演",
            "link": "https://weread.qq.com/web/bookDetail/3a0321405d02ad3a07da450?",
            "description": "阿加莎·克里斯蒂<br>万圣节前夜的派对上，十三岁女孩儿乔伊斯声称自己曾目睹过一场谋杀，但大家只当她是为了引人关注编的瞎话，无人当真。然而当晚，乔伊斯便被溺死在了咬苹果游戏的水桶里。赫尔克里·波洛受邀前来破案，众人的说法各异、真假难辨，唯一达成一致的是：所有人都认定乔伊斯在撒谎。那她为何会因为一句谎话而被杀呢？"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/55/YueWen_728521/t6_YueWen_728521.jpg",
            "text": "空幻之屋",
            "link": "https://weread.qq.com/web/bookDetail/4c932a105b1dc94c937f9cd?",
            "description": "阿加莎·克里斯蒂<br>热情的安格卡特尔夫妇照例在空幻庄园招待宾客共度周末。客人们从四面八方赶来，有的满心期待，有的尴尬赴约，有的肩负重任，有的迷惑忐忑……各怀心事的客人已是一团乱麻，没想到又迎来了一位不速之客——知名女影星维罗妮卡，她曾与前来度周末的已婚医生有过一段情事。空幻庄园瞬间掀起情感风暴，身处风暴中心的约翰倒毙在游泳池边，案情明了，线索丰富。可就是这样一场简单谋杀，几乎搅晕了波洛的大脑，看似热闹的空幻庄园似乎吸走了所有人的鲜活情感……"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/4/YueWen_852669/t6_YueWen_852669.jpg",
            "text": "蓝色列车之谜",
            "link": "https://weread.qq.com/web/bookDetail/6d032cf05d02bd6d080115e?",
            "description": "阿加莎·克里斯蒂<br>在一辆开往法国尼斯的蓝色列车上，富家女露丝·凯特林惨遭杀害，随身的稀世宝石“火焰之心”不知所踪。女仆提供的线索表明，露丝被杀前曾与一个高个子男人在一起。神秘的列车，离心的丈夫，贪婪的情人，虚幻的爱情，地中海旖旎风光下隐藏的恶意蠢蠢欲动。为查明真相，波洛再乘蓝色特快列车，最后终于发现一切均是谎言……"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/185/732185/t6_732185.jpg",
            "text": "藏书室女尸之谜",
            "link": "https://weread.qq.com/web/bookDetail/74e325805b2c1974e7d1402?",
            "description": "阿加莎·克里斯蒂<br>戈辛顿是一幢典型的贵族宅邸，主人是当地德高望重的人物，直到……他们家古色古香的藏书室里出现了一具美艳的女尸！谋杀案打破了英国小村的宁静。流言四起，班特里上校这个出了名的老实人一下子陷入最不堪的丑闻。班特里夫人决心捍卫丈夫的名誉，请来了好友马普尔小姐。英国刑警查出了被害人的身份——一家酒店的舞女，即将被富商收养，并得到一大笔财富。此时出现的另一起谋杀案让案情更加扑朔迷离。这一次，熟知人性和谎言的马普尔小姐找出了最关键的一点——作案动机……"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/18/YueWen_728498/t6_YueWen_728498.jpg",
            "text": "云中命案",
            "link": "https://weread.qq.com/web/bookDetail/72d324005b1db272d899669?",
            "description": "阿加莎·克里斯蒂<br>飞往巴黎的普罗米修斯航班上，波洛正在为晕机的毛病烦恼，一位漂亮女孩正倾心于对面坐着的英俊青年，一位医生在吹长笛，两位考古学家在热烈地讨论学术问题，一位伯爵夫人则和自己的情敌虚情假意地寒暄……然而谁都没有注意到，二号座位上那位上了年纪的法国女人，已经在不知不觉中被一只神秘的手夺去了生命，脚边落着一根只有在小说中才会出现的毒针……"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/57/YueWen_728523/t6_YueWen_728523.jpg",
            "text": "葬礼之后",
            "link": "https://weread.qq.com/web/bookDetail/968322d05b1dcb968dddaa1?",
            "description": "阿加莎·克里斯蒂<br>理查德·阿伯内西在死前留下了一大笔财产。在他的葬礼之后，他的妹妹、行为举止总是颇为奇怪的科拉小姐竟说了这样的话——“可他是被谋杀的，不是吗？”次日，科拉在家中的床上惨遭杀害。六个遗产受益人均有作案动机，每个人都恰巧没有不在场证明！这桩“有趣”的案件令波洛陷入窘境……他能否从和家族成员的对话中抽丝剥茧并发现蛛丝马迹？迷雾重重，真相直到故事最后才被揭开！"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/891/22289891/t6_22289891.jpg",
            "text": "复仇女神",
            "link": "https://weread.qq.com/web/bookDetail/95b3257071541de395b4ff1?",
            "description": "阿加莎·克里斯蒂<br>过着安宁的老年生活的马普尔小姐突然收到一封信，一位老朋友愿赠予她一笔数额巨大的遗产，前提是她为他做一件事。然而信中并没说具体是什么事，只把此次行动称为“复仇女神”。马普尔小姐在毫不知情的情况下开始了这位朋友为她准备的“旅行”，她确信这项任务与犯罪有关，于是，她要先“发现罪行”。她必须怀疑每个人、每件事，而这趟意外频发的破案之旅，看起来越来越危险了……"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/13/YueWen_22289899/t6_YueWen_22289899.jpg",
            "text": "控方证人（同名电影原著）",
            "link": "https://weread.qq.com/web/bookDetail/e6432fb071541debe64ac0e?",
            "description": "阿加莎·克里斯蒂<br>伦纳德·沃尔被控谋杀富婆艾米丽以图染指其巨额遗产，他却一再表明自己的无辜。伦纳德的妻子是唯一能够证明他无罪的证人，却以控方证人的身份出庭指证其确实犯有谋杀罪。伦纳德几乎陷入绝境，直到一个神秘女人的出现……墙上的犬形图案；召唤死亡的收音机；蓝色瓷罐的秘密；一只疯狂的灰猫……十一篇神秘的怪谈，最可怕的不是“幽灵”，而是你心中的魔鬼。"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/52/33617052/t6_33617052.jpg",
            "text": "斯泰尔斯庄园奇案",
            "link": "https://weread.qq.com/web/bookDetail/52f326e07200f49c52fc840?",
            "description": "阿加莎·克里斯蒂<br>《斯泰尔斯庄园奇案》从第一次世界大战期间开始落笔创作，据作者说，灵感主要来自于作者在医院做志愿者时的经历。故事内容主要如下：斯泰尔斯庄园的女主人埃米莉·英格尔索普夫人掌管着庄园的财政大权。在某个周二的凌晨，在自己的房间里因中毒而身亡，而通往外界的房间的三个门全部都从里面锁上的。一个名叫波罗的大侦探接受了调查此案的任务。他在调查此案的过程中发现，壁炉里有烧掉的遗嘱还存留的一些碎纸片，咖啡杯好像也是被摔碎的等疑点。最大的疑犯其实就是比死者小20几岁的丈夫阿尔弗雷德·英格尔索普先生。不过，小伙子却有不在场的有力证据。此外，还有死者与前夫生的两个儿子以及相关的几个其他人，几乎所有人都有犯罪机会，也就是说，每个人都有许多疑点。那么，到底凶手到底是谁呢？抑或是几个人合谋把人害死？"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/24/YueWen_728511/t6_YueWen_728511.jpg",
            "text": "怪屋",
            "link": "https://weread.qq.com/web/bookDetail/406324c05b1dbf406d850ae?",
            "description": "阿加莎·克里斯蒂<br>青年外交官查尔斯与美丽的索菲娅相爱，两人约定在二战结束后成婚。战后，查尔斯回到英国，听到的第一个消息便是索菲娅的爷爷——富商利奥尼迪斯在家中被人毒杀。查尔斯试图从住在这幢怪屋里的十一个人中找出凶手，未婚妻却对他说：“我们是一个怪异的大家庭，所有人都冷酷无情——但这种冷酷是以不同的形式表现出来的。这就是麻烦所在，让人看不清真相……”"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/517/728517/t6_728517.jpg",
            "text": "沉睡谋杀案",
            "link": "https://weread.qq.com/web/bookDetail/7fc328405b1dc57fca4bfdd?",
            "description": "阿加莎·克里斯蒂<br>新婚的格温达搬进了海边的一幢白色别墅。她兴致勃勃地布置自己的新家，一桩桩怪事却接连发生。“难道，这房子闹鬼？”种种线索显示，作祟的不是鬼魂，而是多年前发生的一起谋杀案。格温达向马普尔小姐求助，得到的忠告却是“让沉睡的谋杀案继续沉睡”。可好奇的年轻人不甘心停止追查。终于，过去的罪恶苏醒，即将写下新的悲剧……"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/526/728526/t6_728526.jpg",
            "text": "长夜",
            "link": "https://weread.qq.com/web/bookDetail/089326905b1dce08935624b?",
            "description": "阿加莎·克里斯蒂<br>美丽宁静的吉卜赛庄，却被传言是一所遭受了诅咒的住所，许多擅自进入的人都会在事故中丧生，没有人能够逃脱。然而英俊潇洒的穷小子迈克还是一眼看中了这里，奢望成为这里的主人。他与富家小姐艾丽在这里相遇、相爱，不久后便结婚、定居。他相信自己已经拥有了世界上最美好的一切，可那可怕的诅咒会放过他们吗？有一天，艾丽骑马出去，再也没有回来……"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/85/YueWen_728530/t6_YueWen_728530.jpg",
            "text": "鸽群中的猫",
            "link": "https://weread.qq.com/web/bookDetail/178325205b1dd2178f25bf2?",
            "description": "阿加莎·克里斯蒂<br>著名女子学院“芳草地”迎来了新的学期。新入学的女孩里有一位谢斯塔公主，她的表哥刚刚在一场政变中被害，大批珠宝也随之遗失。随着她的到来，一连串阴谋渐渐笼罩了这所学校，不断有教师被害，谢斯塔公主也随即失踪。究竟谁是潜伏在温顺鸽群里的那只露出爪子的猫？"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/0/YueWen_24058393/t6_YueWen_24058393.jpg",
            "text": "首相绑架案",
            "link": "https://weread.qq.com/web/bookDetail/0d4322b0716f1a190d4e535?",
            "description": "阿加莎·克里斯蒂<br>“波洛，我们还是不要研究破案了，开始从事犯罪活动吧！”“你是在想——那叫什么来着？一夜暴富吧，嗯，我的朋友？”十一则波洛的短篇探案故事：笼罩在神秘传说中的珍贵钻石，廉价出租的豪华公寓，狩猎小屋里的离奇死亡，百万债券不翼而飞，埃及法老的邪恶诅咒，还有被绑架的首相……波洛不光经历了两次晕船，染上了流感，还要学习画魔法阵……这次他又会如何解决案件？"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/61/YueWen_24139758/t6_YueWen_24139758.jpg",
            "text": "伯特伦旅馆",
            "link": "https://weread.qq.com/web/bookDetail/97132830717057ee971f619?",
            "description": "阿加莎·克里斯蒂<br>“我真的想去伯特伦旅馆——在伦敦。”为了重温儿时回忆，马普尔小姐来到了伦敦的伯特伦旅馆，进门的一瞬间，简直就像回到了爱德华时代的英格兰：温暖的壁炉，优雅的侍者，完美的下午茶。就在这样一座旅馆，心不在焉的教士，素未谋面的母女，与周围环境格格不入的赛车手，还有马普尔小姐齐聚一堂。而随着教士的失踪，伯特伦完美的表象也逐渐剥离，露出了原本斑驳的面目……"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/500/728500/t6_728500.jpg",
            "text": "人性记录",
            "link": "https://weread.qq.com/web/bookDetail/678322d05b1db4678f626c1?",
            "description": "阿加莎·克里斯蒂<br>简·威尔金森是一名成功的女演员，一心想要摆脱脾气古怪的丈夫埃奇韦尔男爵，并不止一次在公开场合宣称要亲手杀了他。人们把这当做她任性的玩笑，直到埃奇韦尔男爵真的死在了书房里，管家还目击简走了进去。当信心十足的警察找上简的时候，却发现另有十多位证人宣誓证明简当时正在城市的另一边参加晚餐会。也许最明显的罪犯并不是真正的凶手？毕竟，埃奇韦尔男爵身边还围绕着声名狼藉的侄子、敏感激动的女儿、鬼鬼祟祟的管家……"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/501/728501/t6_728501.jpg",
            "text": "他们来到巴格达",
            "link": "https://weread.qq.com/web/bookDetail/56d329f05b1db556d3ccef1?",
            "description": "阿加莎·克里斯蒂<br>伦敦姑娘维多利亚年轻、漂亮、生机勃勃，就是做事有那么一点冲动。午后的一场公园邂逅就让她决定追随刚认识的“情人”前往巴格达，即便她兜里只有几英镑，即便她连情人的姓氏都没问。巴格达，这个神秘的东方城市迅速将维多利亚卷入旋涡，还搞不清状况的英国小姐只能依靠心中对情人的爱获取力量，试图理出头绪。局势瞬息万变，危险不断升级，维多利亚却渐渐乐在其中，并决定反客为主。只是，仅凭爱和勇气，她逃得出这座处处暗藏玄机的古城吗？"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/768/24139768/t6_24139768.jpg",
            "text": "加勒比海之谜",
            "link": "https://weread.qq.com/web/bookDetail/80c32e20717057f880c834c?",
            "description": "阿加莎·克里斯蒂<br>“想看看杀人凶手的照片吗？”马普尔小姐在侄子雷蒙德的款待下，来到加勒比海上的西印度群岛度假。正当她百无聊赖时，饶舌的帕尔格雷夫少校向她讲述了一桩奇特的谋杀案。就在上校刚要把凶手快照递给马普尔小姐之时，他突然脸色一变，藏起照片，转移话题。马普尔小姐的好奇心燃起，准备隔日一问究竟，谁知第二天竟接获噩耗帕尔格雷夫少校已于昨夜因高血压病发身亡！那张快照亦不翼而飞……"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/66/3300019866/t6_3300019866.jpg",
            "text": "远行译丛：说吧，叙利亚",
            "link": "https://weread.qq.com/web/bookDetail/7f232090813ab6e42g016d18?",
            "description": "阿加莎·克里斯蒂<br>1930年，命运安排年轻的考古学家马克斯•马洛万和当时已负盛名的阿加莎•克里斯蒂相识，但阿加莎的名气并未阻碍她分担丈夫的工作。她参与了马克斯在叙利亚和伊拉克的每一场发掘，与他同甘共苦，在考古学家遭遇的各种灾难事件中不断筛取笑料。她爱她的丈夫，对考古有着浓厚的兴趣，当朋友问起她的异乡生活时，她决定用这部轻松的游记来告诉他们答案。 本书初版于1946年，描绘了考古旅途中的艰辛和乐趣，从中能体会阿加莎独具的魅力，同时也能找到《古墓之谜》和《死亡约会》的影子。"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/503/728503/t6_728503.jpg",
            "text": "古墓之谜",
            "link": "https://weread.qq.com/web/bookDetail/4eb326705b1db74eb5eaa18?",
            "description": "阿加莎·克里斯蒂<br>护士艾米·莱瑟兰接受考古学家莱德纳博士的聘用，来到哈沙尼的挖掘场，照顾莱德纳博士美丽而神经质的妻子。不知为什么，所有人都觉得考古队里的气氛越来越奇怪，这真的是因为莱德纳太太不断产生的被害妄想吗？至少有一个人知道那不是妄想，因为在一个风和日丽的下午，莱德纳太太真的陈尸于窗户紧锁的房间中……"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/903/22289903/t6_22289903.jpg",
            "text": "山核桃大街谋杀案",
            "link": "https://weread.qq.com/web/bookDetail/17532d0071541def175b3ca?",
            "description": "阿加莎·克里斯蒂<br>山核桃大街上有一所留学生宿舍，这里住着肤色不同、性格迥异的男男女女，相处还算和睦。只是近来，接连发生诡异的失窃事件，丢失的都是不太值钱的东西，比如灯泡、姑娘用的口红、一只鞋子之类的。女管家哈伯德太太没太在意，直到有一个姑娘的毕业论文被人泼了墨水，她才觉得此事暗藏恶意，必须严肃对待。哈伯德太太找来波洛调查，波洛在宿舍里提议“报警”，此言一出，当晚便有人“自首”。然而自首的姑娘第二天都死了，并被拙劣地伪装成自杀。凶案将警察引来了山核桃大街，更疯狂的凶杀也接踵而至。残忍的真凶真的是涉世未深的学生之一吗？"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/91/YueWen_22289905/t6_YueWen_22289905.jpg",
            "text": "四魔头",
            "link": "https://weread.qq.com/web/bookDetail/85d328f071541df185dd4fd?",
            "description": "阿加莎·克里斯蒂<br>举世闻名的名侦探波洛遇到了最强劲的对手！他们是一个团队，四个人，身份不明且各自身怀绝技。仿如福尔摩斯遭遇莫里亚蒂，波洛这次也要与他们一决雌雄！然而在忠实的黑斯廷斯看来，年迈的波洛步步失策，似乎败局已定。从伦敦到巴黎，再到神秘的东方，波洛是被“四魔头”牵着鼻子走，还是一切尽在掌握？"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/766/24139766/t6_24139766.jpg",
            "text": "黑麦奇案",
            "link": "https://weread.qq.com/web/bookDetail/b36326c0717057f6b369ccc?",
            "description": "阿加莎·克里斯蒂<br>老弗特斯科先生的晚年生活相当不平静：生意上，他与大儿子的意见相左，财务安排上的失策令他损失不小；家庭中，小儿子远走海外多年，第二任妻子总是以打高尔夫球的名义与别的男人偷情，女儿也陷入不靠谱的恋情中；生活上，非洲采矿的经历让他结下了仇家，不时出现在他面前的黑画眉尸体暗示着复仇者的阴魂不散。终于，老弗特斯科被毒死在了自己的办公室。毒物紫杉碱似乎就出自他的宅邸“紫杉小筑”。接二连三的命案令弗特斯科一家人心惶惶，马普尔小姐发现，凶手竟是按照一首童谣行动的。"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/23/YueWen_24139778/t6_YueWen_24139778.jpg",
            "text": "幽巷谋杀案",
            "link": "https://weread.qq.com/web/bookDetail/7dc321c0717058027dc8300?",
            "description": "阿加莎·克里斯蒂<br>四个简单明快的探案故事。即将再婚的艾伦夫人一早被室友发现死于家中，看起来像是自杀但又疑点重重；一份重要的军事文件失窃，现场的两位绅士所言竟相互矛盾，更可疑的是案发时还有人声称看到了鬼；波洛受到邀请，傍晚时分来到一位贵族老爷的宅邸，可这位老爷却开枪自杀了，案发现场破碎的镜子让大侦探心生怀疑；希腊的著名度假小岛上发生了常见的三角恋，女人们议论纷纷，波洛却忧心忡忡。"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/135/24140135/t6_24140135.jpg",
            "text": "顺水推舟",
            "link": "https://weread.qq.com/web/bookDetail/72b32c207170596772bc7ff?",
            "description": "阿加莎·克里斯蒂<br>在与一位年轻貌美的寡妇罗萨琳结婚仅仅几周以后，戈登·克洛德就死于伦敦的一场空袭。他的庞大家产自然而然落到了年轻妻子手里。另一方面，克洛德家族的人虽表面上都有体面的工作，实际却都依靠戈登而活。他的突然死亡，以及遗产被罗萨琳独吞这一现实，使得矛盾顿时尖锐起来。这时，村子里来了一个自称伊诺克·雅顿的神秘男子，他以罗萨琳前夫安德海其实还活着为由，向罗萨琳和她哥哥大卫进行敲诈。谁料，他竟被人谋杀在旅店房间中。而证人波特少校居然当庭指认死者就是已经去世多年的安德海本人……"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/507/728507/t6_728507.jpg",
            "text": "寓所谜案",
            "link": "https://weread.qq.com/web/bookDetail/39532e405b1dbb395f23a24?",
            "description": "阿加莎·克里斯蒂<br>“无论是谁杀了普罗瑟罗上校，他都为整个世界做出了贡献。”受人尊敬的牧师刚刚发表这番言论，讨人嫌的普罗瑟罗上校就在牧师寓所里被杀了，嫌疑人竟然有七个！此案惊动了所有圣玛丽米德所有村民，各路人马纷纷出动。傲慢的警探虚张声势，全无头绪。倒霉的牧师东奔西跑，徒劳无功。只有机智的马普尔小姐安坐家中，不动声色就找出了真凶。"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/27/YueWen_852671/t6_YueWen_852671.jpg",
            "text": "零点",
            "link": "https://weread.qq.com/web/bookDetail/e3e322d05d02bfe3ee33cd3?",
            "description": "阿加莎·克里斯蒂<br>一段变心与背叛的过往，两个性格完全不同的女人，三对陷入感情纠葛的年轻男女。在海鸥角的聚会上，从四面八方汇集而来的众人不约而同地感觉到悲剧的降临。谋杀其实早已开始，它默默无声地经历了起因、过程，并在某一特定时间、某一特定地点达到最高潮。谋杀本身就是故事的结局，是零点时刻。"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/883/22289883/t6_22289883.jpg",
            "text": "暗藏杀机",
            "link": "https://weread.qq.com/web/bookDetail/6233211071541ddb6237270?",
            "description": "阿加莎·克里斯蒂<br>汤米和塔彭丝重逢啦！但两个年轻人都穷得叮当响，古灵精怪的塔彭丝决定登报求职——“年轻冒险家公司愿意为您做任何事”，没想到这样一则广告第二天就引来一位客人。塔彭丝愉快地赴约，却觉得事有蹊跷，在被问到姓名时，谨慎的她说了个街上听来的名字“简·芬恩”，没想到自此引起轩然大波。事情显然另有隐情，塔彭丝和汤米决定追查到底。为了金钱，更为了伟大的冒险精神！"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/7/YueWen_22289893/t6_YueWen_22289893.jpg",
            "text": "黑咖啡",
            "link": "https://weread.qq.com/web/bookDetail/9fa3280071541de59fabe9f?",
            "description": "阿加莎·克里斯蒂著 查尔斯·奥斯本改编<br>物理学家克劳德·艾默里爵士研究出了一个全新的方程式，预示着一种威力惊人的新型炸药即将诞生。然而，他那张写有方程式的纸片却在家里被盗了。克劳德爵士将全家人聚集在阅览室里，命令管家关上灯，希望窃贼能在黑暗中归还方程式，然而当灯光再次亮起时，他已然死去……这次，波洛不仅要破解这起谋杀案，而且必须阻止一场世界性的恐怖危机……"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/897/22289897/t6_22289897.jpg",
            "text": "惊险的浪漫",
            "link": "https://weread.qq.com/web/bookDetail/b02323b071541de9b028eb7?",
            "description": "阿加莎·克里斯蒂<br>帕金顿太太近来诸事不顺，深感孤单、无助、绝望，但她的命运却因为《泰晤士报》上的一则广告而改变了：你快乐吗？如果不，请到里士满大街十七号，帕克∙派恩先生在这里愿意为您解忧。无论是挽救一段破碎的婚姻，还是解开一桩棘手的杀人案，都难不倒帕克·派恩这位史上最反常规、最迷人的私家侦探。"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/909/22289909/t6_22289909.jpg",
            "text": "意外来客",
            "link": "https://weread.qq.com/web/bookDetail/6b532e5071541df56b50196?",
            "description": "阿加莎·克里斯蒂著 查尔斯·奥斯本改编<br>扑朔的迷雾之中，难辨谁是真凶，谋杀背后，究竟隐藏着眼泪还是愤怒？倒霉的斯塔克韦瑟在迷雾中失去方向，把车开进了沟里。他只能徒步来到附近的一所住宅求救，没想到却踏入了凶案现场——女主人劳拉·沃里克正站在已经身亡的丈夫身旁，手中紧握着一把枪……看着这位美丽而无措的妻子，斯塔克韦瑟决定帮助她。这个家中还住着男主人心智不全的弟弟，来日无多的母亲，别有用心的男仆，以及女管家班尼特小姐。众人似乎都顺理成章地接受了斯塔克韦瑟编造的嫌疑犯人选。凶手，真的能就此逃脱惩罚吗？"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/96/YueWen_728504/t6_YueWen_728504.jpg",
            "text": "命案目睹记",
            "link": "https://weread.qq.com/web/bookDetail/16632fa05b1db81663bd33f?",
            "description": "阿加莎·克里斯蒂<br>有那么几秒钟，两列火车平行行驶在一起。在这恐怖的瞬间，伊丽莎白确信自己见证了一场谋杀。还能是什么呢？一个男子残忍地箍紧了一个女人的喉咙。而伊丽莎白只能透过车厢窗口徒劳地望着——女人的身体瘫软了。而火车，也开远了。"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/63/YueWen_728529/t6_YueWen_728529.jpg",
            "text": "魔手",
            "link": "https://weread.qq.com/web/bookDetail/305329805b1dd13056a646f?",
            "description": "阿加莎·克里斯蒂<br>伯顿兄妹搬到一个平静的乡村小镇疗养身心，可刚安顿下来，就接到了一封充满恶意的匿名信，指控两人乱伦。惊讶之余他们发现，小镇居民已经陆陆续续地收到了内容各异的匿名信，事态变得越发严重，终于演变成一场命案……"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/28/YueWen_852672/t6_YueWen_852672.jpg",
            "text": "马普尔小姐最后的案件",
            "link": "https://weread.qq.com/web/bookDetail/1e832d705d02c01e8e3d70a?",
            "description": "阿加莎·克里斯蒂<br>这是一部短篇小说集，内含九个故事。一个神秘男子带着枪伤晕倒在教堂；一位死去老人埋藏的宝藏谜团；一具死尸与一卷软尺；一个疯癫看门人引发的一次致命坠马事故；一位十全十美的女仆；一起密室“杀妻”案；一桩遗产继承谋杀案。七个精彩纷呈的故事，马普尔小姐依旧惊人的洞察力和推演能力！还有两起非马普尔探案系列的灵异案件：裁缝的洋娃娃与神秘的镜子，用惊悚片的效果直击人性。"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/33/YueWen_935491/t6_YueWen_935491.jpg",
            "text": "幸福假面",
            "link": "https://weread.qq.com/web/bookDetail/229326005e46432292fb9d2?",
            "description": "阿加莎·克里斯蒂<br>琼是个彻底务实的人，从小只想过安稳的日子；她挑有前途的律师结婚、阻止丈夫追求田园生活，也要求三个孩子都依她的价值观去做人生规划。一次探望小女儿的返程途中，火车因雨季路断而停开，她受困沙漠中的一个小站，每天只能在附近沙丘散步，走着走着，她开始面对自己，一件件以往刻意忽略的“小事”这时都不请自来……《幸福假面》初版于1944年，是阿加莎·克里斯蒂一生最满意的作品之一。她藉本书满足了一个对自我的提问：我是谁？我“真正”是个什么样的人？我所爱的人对我有何想法？他们对我的想法是否如我所想？过程峰回路转，真实而残酷。"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/2/YueWen_24058395/t6_YueWen_24058395.jpg",
            "text": "雪地上的女尸",
            "link": "https://weread.qq.com/web/bookDetail/58332420716f1a1b583a9c6?",
            "description": "阿加莎·克里斯蒂<br>这是阿加莎·克里斯蒂专为圣诞节准备的大餐。前菜：《梦境》和《弱者的愤怒》。神秘富翁近日来反复梦见自杀，他向多方求助但最终仍未逃出死亡的魔掌；一桩看似已了结的命案，死者的妻子却一口咬定真凶另有其人。主菜：《雪地上的女尸》和《西班牙箱子之谜》。波洛应大人物之邀前去追回王子失窃的宝石，却在做客的家庭里遭遇雪地命案；几位上流社会的男女们常常一起聚会，这一次狂欢过后，其中一位竟死在客厅的箱子里。还有饭后冰淇淋：《二十四只黑画眉》。年迈的亨利每周二和周四都去同一家餐厅吃晚餐，跌下自家楼梯那天他也去了，只不过点了完全不同的食物，波洛认为死亡的秘密就藏在黑莓派里。祝您有个好胃口。"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/17/YueWen_24058417/t6_YueWen_24058417.jpg",
            "text": "三只瞎老鼠",
            "link": "https://weread.qq.com/web/bookDetail/a8e32460716f1a31a8eff8f?",
            "description": "阿加莎·克里斯蒂<br>在一个风雪交加的日子，帕丁顿卡尔弗大街七十四号发生了一起谋杀案。凶手在死者身上留下了画着三只老鼠以及一小段《三只瞎老鼠》乐谱的信纸。在逃离现场时，凶手不小心从兜里掉出了一个笔记本，上面只记着两个地址：卡尔弗大街七十四号和蒙克斯维尔庄园。另一头，蒙克斯维尔庄园的新主人，戴维斯夫妇正为这处全新的家庭旅馆延揽顾客。当晚，四位奇怪的客人先后入住。恐怖的《三只瞎老鼠》曲调响起，凶手又要开始TA的捕鼠计划……"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/762/24139762/t6_24139762.jpg",
            "text": "怪钟疑案",
            "link": "https://weread.qq.com/web/bookDetail/bf632090717057f2bf6492c?",
            "description": "阿加莎·克里斯蒂<br>一间到处都是钟表的诡异房间，一具躺在地板上的无名男尸，一个失魂落魄的年轻女郎，一位双目失明的孤寡老妇，一条呈弯月形的奇特街道，一群各怀鬼胎的神秘住户……又一桩谋杀正在酝酿，时间一分一秒地流逝。这一次，伟大的侦探赫尔克里·波洛坐在轮椅上就锁定了凶手。"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/88/YueWen_24139764/t6_YueWen_24139764.jpg",
            "text": "赫尔克里·波洛的丰功伟绩",
            "link": "https://weread.qq.com/web/bookDetail/b4332700717057f4b4326b4?",
            "description": "阿加莎·克里斯蒂<br>赫尔克里·波洛，这位全世界最优秀、可能也是最自恋的侦探，竟想退休去郊区种西葫芦！他的好友为此嘲笑他，说他配不上自己的名字。因为赫尔克里与希腊神话中的大力神赫拉克勒斯名字仅相差一个字母，而赫拉克勒斯可有赫赫有名的十二项丰功伟绩。波洛自然不会服输，他决定，要再接十二桩案子，最好能像赫拉克勒斯的十二项功业那么离奇、艰难又有趣。但当然啦，不是那种付出体力的，他的武器是灰色的脑细胞嘛。"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/17/YueWen_24139772/t6_YueWen_24139772.jpg",
            "text": "闪光的氰化物",
            "link": "https://weread.qq.com/web/bookDetail/a29327a0717057fca299ef3?",
            "description": "阿加莎·克里斯蒂<br>罗斯玛丽，美好的名字。拥有这个名字的美丽少妇在生日宴会上惨死，警方认定为服用氰化物自杀。罗斯玛丽又有迷迭香的意思，而迷迭香的花语是爱的回忆。痛失爱妻的乔治一日都未曾忘记那一晚。一年过去了，他决定在同一天、同一家餐厅、同一张桌子、邀请同一批人，为亡妻罗斯玛丽祈福。当然，这只是表面借口。六个人围坐在七人的晚餐桌前，哪一个才是真凶？"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/94/YueWen_728502/t6_YueWen_728502.jpg",
            "text": "借镜杀人",
            "link": "https://weread.qq.com/web/bookDetail/226329505b1db6226c90485?",
            "description": "阿加莎·克里斯蒂<br>在《借镜杀人》一书中，卡莉·路易丝是个奇妙的女人。两任前夫让她坐拥豪宅，一辈子衣食无忧，现任丈夫虽然性情古怪，却毫无保留地爱着她。儿女绕膝、亲戚友善、仆从忠诚，甚至岁月都未在她脸上留下太多痕迹。这样的人生堪称完美，但她的老同学却觉得她身边环绕着不祥气息，甚至有死亡的征兆。"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/515/728515/t6_728515.jpg",
            "text": "桑苏西来客",
            "link": "https://weread.qq.com/web/bookDetail/15a32aa05b1dc315ad4b6aa?",
            "description": "阿加莎·克里斯蒂<br>二战期间，英军奋力击退了德国空军的进攻，更加险恶的敌人——乔装成普通市民的纳粹分子——却从内部威胁着国家安全。代号为“N”和“M”的德国间谍杀害了英国最优秀的特工。迫于压力，情报部门起用被“闲置”已久的汤米和塔彭丝贝尔斯福德夫妇。他们的任务是在海滨旅馆桑苏西的住客中找出N和M。书中的汤米和塔彭丝身边危机四伏，故事作者阿加莎也因创作此书受到军情五处调查。"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/78/YueWen_22289885/t6_YueWen_22289885.jpg",
            "text": "大象的证词",
            "link": "https://weread.qq.com/web/bookDetail/ada3254071541dddadafc3f?",
            "description": "阿加莎·克里斯蒂<br>高贵美丽的夫人挽着年长的丈夫在悬崖边散步。第二天夫妻被发现双双陈尸崖底。这是一起自杀约定？还是蓄谋已久的谋杀？一场文学午宴，牵扯出一桩陈年旧案。大侦探波洛和奥利弗太太为了探明真相，踏上了寻找大象的旅程。据说，大象拥有绝佳的记忆力。无论时间如何流逝，大象不会忘记。"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/80/YueWen_22289887/t6_YueWen_22289887.jpg",
            "text": "犯罪团伙",
            "link": "https://weread.qq.com/web/bookDetail/38c32ab071541ddf38cf3f8?",
            "description": "阿加莎·克里斯蒂<br>汤米和塔彭丝·贝尔斯福德夫妇喜爱冒险，于是爽快地从苏格兰场手中接管了国际卓越侦探所，开门迎客。事实上，他们的秘密任务是特别留意那些贴着俄国邮票，且邮票背面写着数字十六的蓝色信件。更重要的是，如果有人来到办公室提及数字十六，必须立刻通知苏格兰场。汤米和塔彭丝轮番扮演著名侦探小说中的名侦探们，解决了一个又一个案子。只是那个代号十六的人却姗姗来迟。最终，出演大侦探波洛和搭档黑斯廷斯的汤米夫妇能否顺利地解决这最后一案？"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/82/YueWen_22289889/t6_YueWen_22289889.jpg",
            "text": "奉命谋杀",
            "link": "https://weread.qq.com/web/bookDetail/87b3207071541de187b4895?",
            "description": "阿加莎·克里斯蒂<br>卡尔加里博士在傍晚时分突然造访居住在艳阳角的阿盖尔一家，带来一个消息：涉嫌谋杀母亲并被定罪、最终惨死监狱中的小儿子杰克是被冤枉的。博士本人可以证实他的不在场证明。然而这迟来的正义却让一家人茫然，甚至惊恐。卡尔加里博士大惑不解，他觉得这个家里藏着些秘密。时至今日还能查出陈年旧案的真凶吗？而查出真凶真的是此事最好的解决方式吗……"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/895/22289895/t6_22289895.jpg",
            "text": "金色的机遇",
            "link": "https://weread.qq.com/web/bookDetail/0fe3244071541de70fef970?",
            "description": "阿加莎·克里斯蒂<br>利斯特戴尔勋爵的离奇失踪；一个恐惧丈夫的新婚女子；藏在樱桃篮里的珍贵项链；因谋杀罪被捕的推理作家；一个破天荒的结婚计划；只需两便士就能娶到媳妇儿？当然，只要你抓住那金色的机遇！……轻松、浪漫的爱情冒险，欧·亨利般的意外结局，十二则睡前小品，带你进入金色梦乡。"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/18/YueWen_22289911/t6_YueWen_22289911.jpg",
            "text": "蜘蛛网",
            "link": "https://weread.qq.com/web/bookDetail/60c32e2071541df760c7a78?",
            "description": "阿加莎·克里斯蒂著 查尔斯·奥斯本改编<br>外交官夫人克拉丽莎既喜欢开玩笑，又充满想象力，经常幻想自己某一天下楼，会在图书室里发现一具尸体。谁料，一语成谶，她竟真的被客厅里的一具尸体绊倒！更糟的是，继女皮帕向她亲口承认自己就是凶手。当晚，她的丈夫将带一名神秘的外国贵宾来家里与首相会晤。为了丈夫的仕途，更为了保护继女，克拉丽莎费力说服家中的三位客人帮忙掩盖这起命案……没想到警方不请自来。克拉丽莎不得不开始编织谎言，一张蜘蛛网将众人拉入陷阱……"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/535/23796535/t6_23796535.jpg",
            "text": "捕鼠器",
            "link": "https://weread.qq.com/web/bookDetail/bf232f10716b1b37bf2ff36?",
            "description": "阿加莎·克里斯蒂<br>全球有史以来连续上演时间最长的舞台剧。 从未间断地上演超过半个世纪的传奇戏码。 推理小说女王克里斯蒂最出色的戏剧作品。 除了圣经和莎士比亚之外，阿加莎·克里斯蒂是世上卖得最好的作家，其八十部作品被译成一百多种文字出版，迄今累计销量超过二十亿册。在这个星球上，每隔七秒钟就有一部克里斯蒂的作品被兑换成英镑、美元、法郎……以及人民币。 打开《捕鼠器》前，关于故事本身，能够泄露的“天机”是：封闭的空间。开放的时间。暧昧错杂的身份。欲盖弥彰的眼神。看不见血腥。听得见心跳。 “它是一出你可以带任何人去看的戏。它并非真正恐怖，也并非确凿的闹剧，但是这些因素，它多少都有一点，也许正因为如此，众多怀着不同期待来的人，都能同时得到满足。” ——阿加莎·克里斯蒂"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/42/YueWen_24058421/t6_YueWen_24058421.jpg",
            "text": "煦阳岭的疑云",
            "link": "https://weread.qq.com/web/bookDetail/9f332640716f1a359f3e2b4?",
            "description": "阿加莎·克里斯蒂<br>汤米和塔彭丝，阿加莎·克里斯蒂笔下的可爱侦探情侣档又回来了。这一次，他们去到一家阴森的哥特式养老院探访上了年纪的艾达姑妈，从而被卷入了一系列诡异的案件中。艾达姑妈脾气暴躁，非常难缠，而养老院里同样住满了性情乖张的老人。洛基特夫人总怀疑蘑菇汤里有毒，兰卡斯特夫人神神秘秘地提到“壁炉后面有东西”……为了探寻真相，汤米和塔彭丝再次踏上了冒险的旅程。河边漂亮又孤单的小房子，戴着尖尖帽子的白女巫，烟囱里的布娃娃，墓地里忽隐忽现的人影……死亡的阴影笼罩，塔彭丝能否化险为夷，锁定真凶？"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/427/24058427/t6_24058427.jpg",
            "text": "褐衣男子",
            "link": "https://weread.qq.com/web/bookDetail/a56324b0716f1a3ba562480?",
            "description": "阿加莎·克里斯蒂<br>少女安妮父母双亡，跟随父亲生前的朋友到伦敦生活。她热爱这个光怪陆离的城市，但心里仍惦记着出去冒险——去曾在书里读到过的非洲，最好再能遇见一个沉默高大的理想男人。没想到一起命案成了安妮冒险的契机。她任由直觉牵引，赌上全部家当参与调查，立志要找到真凶——神秘的“褐衣男子”！命运这艘大船已经起航，前方风高浪急，勇气能成为安妮的指路明灯吗？"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/431/24058431/t6_24058431.jpg",
            "text": "死亡终局",
            "link": "https://weread.qq.com/web/bookDetail/fa332f00716f1a3ffa33320?",
            "description": "阿加莎·克里斯蒂<br>公元前两千年的尼罗河，古埃及。雷妮森痛失丈夫，带着女儿回到了担任大祭司的父亲家里。熟悉的环境和家人似乎是治愈悲伤的良药。一切都仿佛没有改变：性格截然不同的两位兄长和他们吵闹的妻子，被宠坏了的弟弟，睿智的奶奶，还有亦兄亦友的儿时玩伴……这时，父亲突然娶回了一名年轻貌美的继母。她的出现打破了家中微妙的平衡，给整个家族罩上了一层死亡的阴影。雷妮森周围的世界开始逐渐崩塌。“慢慢地，渐渐地，像梦一样，最后，死亡终将降临……”"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/760/24139760/t6_24139760.jpg",
            "text": "第三个女郎",
            "link": "https://weread.qq.com/web/bookDetail/adb32b90717057f0adb2de9?",
            "description": "阿加莎·克里斯蒂<br>三个妙龄女郎合租伦敦的一套公寓。第一个是一位冷静干练的秘书；第二个是一位艺术家；第三个女郎打扰了赫尔克里·波洛的早餐，供认自己是个谋杀犯，之后迅速消失。波洛渐渐了解了围绕在这位神秘的第三个女郎身边的各种传言，她的家庭，还有她的离奇失踪。然而无论伟大的侦探判定她有罪、无罪或是精神失常，都需要确凿的证据……"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/21/YueWen_24139776/t6_YueWen_24139776.jpg",
            "text": "烟囱别墅之谜",
            "link": "https://weread.qq.com/web/bookDetail/53432d40717058005348cbb?",
            "description": "阿加莎·克里斯蒂<br>一本已故伯爵生前撰写的私密回忆录，一件失传已久的稀世珍宝，一位隐藏身份的王室继承人，一个热衷于暗杀的神秘组织，还有颇具邦德风范的、苏格兰场的巴特尔警长，以及来自法国和美国的秘密警察……各路人马轮番登场，所有扑朔迷离的线索交汇之后都指向命案发生的地方——烟囱别墅。"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/2/YueWen_25329272/t6_YueWen_25329272.jpg",
            "text": "地狱之旅",
            "link": "https://weread.qq.com/web/bookDetail/71a32b0071827e7871ae2a0?",
            "description": "阿加莎·克里斯蒂<br>近两年，全世界范围内屡次发生知名科学家失踪事件。这些科学家们全都是突然人间蒸发的，负责此案的机构调查了他们失踪前的行踪，又彻查了亲友关系网，全部一无所获。他们是被绑架了吗？是谁策划了如此声势浩大的失踪案呢？为了解开这个谜，一位男士邀请一位寻死的女人踏上了“地狱之旅”。"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/282/25329282/t6_25329282.jpg",
            "text": "斯塔福特疑案",
            "link": "https://weread.qq.com/web/bookDetail/5cd3272071827e825cdad7d?",
            "description": "阿加莎·克里斯蒂<br>这一晚，斯塔福特寓所被大雪围困。伯纳比少校应邀来到这栋与世隔绝的乡间别墅，和一对刚搬来的母女、一个热衷犯罪学和鸟类观察的学者、一个图谋不轨的年轻人，还有一个平平无奇的路人甲聚在一起，玩起了降神会。谁想幽灵现身，预言了少校友人的死亡。少校匆忙赶到后，友人竟真的横死家中，而推定的死亡时间，竟与幽灵的预言一致！这究竟是恶灵作祟还是蓄意谋杀？一切线索都指向了艾米丽的未婚夫，警方将其逮捕后，艾米丽誓要为他洗清嫌疑，她说：“等等，我先补个妆。”"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/32/YueWen_25566754/t6_YueWen_25566754.jpg",
            "text": "悬崖上的谋杀",
            "link": "https://weread.qq.com/web/bookDetail/bf43221071861e22bf42c79?",
            "description": "阿加莎·克里斯蒂<br>博比·琼斯是个不着调的年轻人。一天，他在高尔夫球场发现有人跌落悬崖，赶过去时此人已经奄奄一息，挣扎着在死前留下了一句莫名其妙的话：“他们干嘛不找埃文斯呢？”博比没有多想，却在事后遭人谋杀未遂。回过神来，他的生活俨然成了一本刺激的侦探小说：危机暗藏的田园生活，新开的精神疗养院，邪恶的医生，吸食毒品的丈夫，角落里的丑闻……"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/496/728496/t6_728496.jpg",
            "text": "七面钟之谜",
            "link": "https://weread.qq.com/web/bookDetail/0f4325905b1db00f4c26a61?",
            "description": "阿加莎·克里斯蒂<br>几个年轻人来到这里度假，他们精心策划了一场恶作剧：用八只钟表吵醒那位似乎永远都会迟到的同伴。清晨，八只钟表依次响起，但这位可怜的同伴却再也无法苏醒。更令人吃惊的是，钟表居然只剩下了七只，有一只被扔出了窗外！紧接着，有一位同伴离奇死亡，而他的遗言竟然是：“七面钟……”“烟囱别墅”的主人邦德尔小姐决心找到真相。而那位在女王的作品中多次出现的、足以令人信任的巴特尔警官，似乎并不愿意帮助这位好奇的姑娘。"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/126/923126/t6_923126.jpg",
            "text": "爱的重量",
            "link": "https://weread.qq.com/web/bookDetail/578326a05e15f6578396d6e?",
            "description": "阿加莎·克里斯蒂<br>阿加莎·克里斯蒂的《爱的重量》讲述了：劳拉有个不幸早逝的哥哥。从小被冷落的她原本希望取代哥哥，成为家中的重心，没想到爸妈却再生了妹妹。从此她不断祈求上帝快点带走妹妹，直到一场骇人大火……作者克里斯蒂是侦探小说女王，吉尼斯世界纪录中“人类最畅销的作家”。作品畅销一百多个国家，翻译成百种语言，累计销量突破二十亿。"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/34/YueWen_33617060/t6_YueWen_33617060.jpg",
            "text": "暗藏杀机",
            "link": "https://weread.qq.com/web/bookDetail/6ca329007200f4a46ca1ee3?",
            "description": "阿加莎·克里斯蒂<br>第一次世界大战期间，英国一艘轮船被德国鱼雷击中，船上的人纷纷逃命，一片混乱场面。有个美国女孩正要登上救生艇逃生，她眼前出现了一个英国男士。这男士将一个小纸包塞到其手里，并且说，请她保护好它，然后匆匆说了联系方式就逃生去了。转眼间，第一次世界大战结束了。小说里的男主人公汤米和女主人公托潘斯本来是平凡人，两人从小青梅竹马，竟然在伦敦不期而遇。两人高兴之余，当下决定一起成立一家冒险公司。但是，后来他们的平凡人的人生波折就如冒险故事一样，遭遇了一个又一个危险事件，然后再从危险事件中挣脱出来。他们遇到了一个情报机关的卡特先生，还遭遇了一位美国百万富翁尤利。故事进一步升级，他们冒险过程中还遇到了美丽而且十分富有的丽塔女士以及神秘的布朗先生。同时，还有一个叫安妮特的女仆也被卷入事情之中。女主人公刚当两天女用人，就发现主人的尸体横卧在卧室里。男主人公汤米则被人莫名其妙地打昏，甚至遭到软禁。"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/32/YueWen_728519/t6_YueWen_728519.jpg",
            "text": "灰马酒店",
            "link": "https://weread.qq.com/web/bookDetail/cf4322205b1dc7cf450cb22?",
            "description": "阿加莎·克里斯蒂<br>《灰马酒店》讲述了年长牧师在听取了一位女病人的临终忏悔后被杀，警方从他身上发现了一张神秘的名单，并发现名单上的人都已去世，死于各种不同的疾病。这一切似乎都指向一个叫灰马酒店的地方，那里的三个女巫声称可以用魔法令人自然死亡。不信邪的伊斯特布鲁克先生决定亲自试一试，很快，他最担心的事情就发生了……"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/9/YueWen_852637/t6_YueWen_852637.jpg",
            "text": "灯火阑珊",
            "link": "https://weread.qq.com/web/bookDetail/75f329e05d029d75f3646b1?",
            "description": "阿加莎·克里斯蒂<br>约翰做了一个美丽庄园的梦，此后他一再地梦到相同的庄园，他也一直渴望进入庄园的里面，直到有一次梦中见到了庄园窗帘后可怖的景象；炙手可热的女演员奥尔加·斯多玛有过一段不堪回首的过去。惯于敲诈女人的无赖贾克知道她的底细；年轻貌美的伊莎贝尔曾是社交场的风云人物。她除了钱，什么都有。在众多追求者中，伊莎贝尔出人意料地选择了当时还默默无闻的画家艾伦。一起意外事件，使得艾伦真正认识了自己的妻子。最后一抹亮色从艾伦的作品上消失了……"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/37/YueWen_852644/t6_YueWen_852644.jpg",
            "text": "逆我者亡",
            "link": "https://weread.qq.com/web/bookDetail/6ae32b205d02a46aebc1209?",
            "description": "阿加莎·克里斯蒂<br>资深警员卢克在乘火车前往伦敦的途中，偶遇了来自乡村的平克顿小姐。这位老小姐声称自己正准备前往苏格兰场，去揭发几起命案的真相。令人诧异的是，她随后便惨遭车祸离世。卢克决定冒充作家前往乡村一探究竟。他在随后的调查中发现，每起案件似乎都介于“意外”与谋杀之间，而另一位老小姐韦恩弗利特似乎掌握着某些关键信息，却对卢克欲言又止……就在此时，“意外”再次发生了，陷入困局的卢克能否拨开迷雾，让村庄恢复到以往的平静之中？"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/66/YueWen_852652/t6_YueWen_852652.jpg",
            "text": "神秘的奎因先生",
            "link": "https://weread.qq.com/web/bookDetail/ba232e405d02acba286247e?",
            "description": "阿加莎·克里斯蒂<br>萨特思韦特先生是一位干瘪瘦小的老头，却有着女性般敏锐的情感。在人生的舞台上，他一直扮演着旁观者的角色，直到一个风雪交加的新年夜，哈利·奎因的到来。来无影去无踪的奎因先生常与爱情和死亡相伴。他文雅地引导着萨特思韦特先生揭示各式各样的秘密，激发其利用自己丰富的阅历和天生的敏感挽救一段又一段爱情，一条又一条生命……"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/127/923127/t6_923127.jpg",
            "text": "母亲的女儿",
            "link": "https://weread.qq.com/web/bookDetail/f39329c05e15f7f3914de9b?",
            "description": "阿加莎·克里斯蒂<br>安与莎拉原是一对非常亲昵的母女，却因先后反对彼此的交往对象，最纯然的亲情也变得暗潮汹涌。尊重成了漠视的借口；牺牲则为嫉妒带来理由。两人都变得扭曲而不快乐……她们对彼此的爱还在吗？在哪里?是什么？阿加莎·克里斯蒂通过自身的生命体验探讨占有与爱的本质等问题。当故事来到母女俩摊牌且将对方逼入死角之际，曙光也乍然展现……作者克里斯蒂是侦探小说女王，吉尼斯世界纪录中“人类最畅销的作家”。作品畅销一百多个国家，翻译成百种语言，累计销量突破二十亿。"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/129/923129/t6_923129.jpg",
            "text": "撒旦的情歌",
            "link": "https://weread.qq.com/web/bookDetail/c1c322805e15f9c1cd1ae04?",
            "description": "阿加莎·克里斯蒂<br>他们绝望地看着彼此，对于人生中诡谲难料的变化，为他们之间带来这样突然的龃龉感到大惑不解。前一分钟他们还这么亲近，似乎分享了对方的每一个念头，下一刻却分处两极，因为对方不能理解自己而感到愤怒又受伤……弗农虽是潜力无限的音乐天才，但现实生活上，他不够富有，却想保住家传的古老宅邸；他必须工作赚钱，却又想全心投入音乐创作；他与初恋情人情投意合，但战争却拆散他们；另一个女人深爱着他，他竟在她死后才知道那是真爱，待初恋情人回头希望复合，他却在此时毅然决定献身音乐……作者克里斯蒂是侦探小说女王，吉尼斯世界纪录中“人类最畅销的作家”。作品畅销一百多个国家，翻译成百种语言，累计销量突破二十亿。"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/14/YueWen_23796537/t6_YueWen_23796537.jpg",
            "text": "捕鼠器",
            "link": "https://weread.qq.com/web/bookDetail/eb832a10716b1b39eb86b52?",
            "description": "阿加莎·克里斯蒂<br>《捕鼠器》讲述1948年冬天，在一个风雪交加的下午，伦敦西二区鸽子街二十四号发生了一起凶杀案。现场线索表明杀人犯已逃亡蒙克斯威尔。就在这个傍晚，在刚刚开业的蒙克斯威尔旅馆里，年轻的雷斯顿夫妇迎来了五位奇怪的客人，凶手在其中吗？危险还存在吗？次日下午，博可夏警察局的警官屈洛特也来到旅馆，他带来了更可怕的消息，风雪把所有人都困在了旅馆里,一场可怕的“杀人游戏”由此开始。"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/10/cpplatform_dpi6kk6w5mexhdh1acy2es/t6_cpplatform_dpi6kk6w5mexhdh1acy2es1697534324.jpg",
            "text": "马普尔小姐历险记",
            "link": "https://weread.qq.com/web/bookDetail/9c132840813ab83c4g017b80?",
            "description": "阿加莎·克里斯蒂<br>简•马普尔是圣玛丽米德村的一位老太太，她有着不可思议的本领，能够破解最复杂的谜题。那顶蕾丝帽下隐藏了全世界最好的破案大脑之一。现在，四十五年来首次，这个阿加莎•克里斯蒂心爱的角色再次回到书中，开始了一段有关犯罪和破案的环球历险。 加入马普尔小姐的奇妙旅行：从她所在的英格兰寂静村庄到全世界。在圣玛丽米德村，一场圣诞晚宴由于不速之客的到来而中断；纽约市的百老汇舞台上，大幕即将为了一场危险的即兴表演拉开；驶向香港的邮轮里，不祥之兆带来了一次不合时宜的死亡；一位畅销书作家的意大利假期中，一个穷凶极恶的阴谋正在酝酿……种种犯罪以爱、嫉妒、敲诈与复仇的名义犯下。只有顽强不屈的简•马普尔可以揭示真相——“因为人性大抵都是相同的。”"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/157/33617157/t6_33617157.jpg",
            "text": "高尔夫球场命案",
            "link": "https://weread.qq.com/web/bookDetail/899326107200f505899c7f3?",
            "description": "阿加莎·克里斯蒂<br>一封求救信让波洛来到了法国，然而他来得太迟了，因为他的委托人已经被人用裁纸刀刺死，面朝下躺在一座高尔夫球场上的墓穴中。为什么死者身上的大衣长出了一大截？大衣口袋里那封热情洋溢的情书又是写给谁的？波洛还没有来得及弄清楚这些问题，第二具尸体又以同样的方式出现了……本书全景展现“侦探女王”的风采与魅力。使读者不仅欣赏到作家的巧妙构思、离奇桥段和睿智语言，而且能体味到浓郁的英伦风情。"
          }
        ]
      },
      {
        text: '东野圭吾 作品集',
        items: [
          {
            icon: "https://cdn.weread.qq.com/weread/cover/27/3300020527/t6_3300020527.jpg",
            text: "解忧杂货店",
            link: "https://weread.qq.com/web/bookDetail/6d132250813ab6e84g017ca5",
            description: "[日] 东野圭吾<br>东野圭吾当之无愧的长篇小说代表作。一本带给人无限温暖、安慰与感动的书。 东野圭吾特别寄语中国读者：“《解忧杂货店》能在中国拥有这么多读者，对我而言既是荣幸也是鼓励。我想在这本书中写的，是无论身处哪个国家、哪个时代的人都一定会抱有的‘梦想’与‘烦恼’。人之所以为人，正是因为这无尽的梦想与烦恼吧。” 我想再创作一部穿越的作品，但这次谁也不穿越。移动时空的不是人，而是信。如果可以和过去的人交换信件，自己要写些什么呢——这种想法成为创作《解忧杂货店》的契机。回顾写作过程，我发现自己始终在思考：站在人生的岔路口，人究竟应该怎么做？我希望读者能在掩卷时喃喃自语：我从未读过这样的小说。——东野圭吾"
          },
          {
            icon: "https://cdn.weread.qq.com/weread/cover/1/yuewen_230107/t6_yuewen_2301071682244014.jpg",
            text: "白夜行",
            link: "https://weread.qq.com/web/bookDetail/65032c105382db65050e7aa",
            description: "[日] 东野圭吾<br>1999年，东野圭吾41岁正值盛年，写作出道已14年，在笔力、技巧、体力和雄心上都炉火纯青，于是洋洋洒洒写出了这部鸿篇巨制《白夜行》。这种规模宏大的长篇作品在职业作家一生的创作中极为罕见，完成后基本都被视为生涯代表作。《白夜行》一经推出即成为东野圭吾的长篇小说代表作，被万千书迷视为东野圭吾作品中的无冕之·王，畅销至今。《白夜行》中文版发行量超600万册，和《嫌疑人X的献身》《恶意》《解忧杂货店》并称为东野圭吾四大杰作。"
          },
          {
            icon: "https://cdn.weread.qq.com/weread/cover/22/cpPlatform_kboEK7t9eX3aznMwkW7YVz/t6_cpPlatform_kboEK7t9eX3aznMwkW7YVz.jpg",
            text: "虚无的十字架",
            link: "https://weread.qq.com/web/bookDetail/dd832e80813ab74b7g017596",
            description: "[日] 东野圭吾<br>《虚无的十字架》充满了东野圭吾对法理与人性的深切思考，将反转离奇的推理过程与思辨之力相结合，每一声拷问都钝重清晰、振聋发聩，却又如鲠在喉。  “回想那一天，我输入了约定好的传呼信息。不知过了多久，我在恍惚间听见了门把手转动的声音。我像蛇一样在地面爬行，耗尽了浑身的力气才抵达玄关。站在门口的是我蕞爱的人，也是我的同谋。我们一起掩埋了罪证。我想，做出了这么可怕的事，我这辈子都不会得到幸福了。那么，就用以后的人生来偿还吧。二十一年过去了。最近，我却觉得有谁在暗处盯着我。”"
          },
        ]
      },
      {
        text: '悬疑推理',
        items: [
          {
            icon: "https://cdn.weread.qq.com/weread/cover/12/cpplatform_27ztfi8zjc17r4ruzuxfws/t6_cpplatform_27ztfi8zjc17r4ruzuxfws1686221000.jpg",
            text: "刺杀骑士团长",
            link: "https://weread.qq.com/web/bookDetail/3a832bc0813ab7e67g0178e2",
            description: "[日] 村上春树<br>“哪怕云层再黑再厚，背面也银光闪闪。”  关于创伤、内省、对峙、重生的力量之作，面对无法挽回的失去，直面无以名之的恶。  科班出身的“我”原本爱好抽象画，为了养家糊口成为专业肖像画画家。结婚六周年纪念日前夕，妻子突然坦言已有外遇，要求离婚，于是“我”独自开车离家开车，最终应好友雨田政彦之邀，住进小田原郊外山间其父雨田具彦的旧居兼画室，调整身心。   “我”在山下的绘画板任教时和班里的两位人妻先后成了情人，经神秘邻居免色的精心策划,和少女真理惠也建立了密切联系。   房主雨田具彦原是著名画家，“我”意外在阁楼发现了一幅雨田具彦不为世人所知的大师级作品，名为“刺杀骑士团长”，就此打开一段尘封的历史。   之后，“我”被卷入一系列不可思议的事件……   夜半铃声与古庙洞口、神秘邻居免色涉与绘画班女学生秋川真理惠、“骑士团长”与“长面人”、现实世界与隐喻世界……   村上春树用他擅长的层层剥开的写法，将读者步步引入奇妙之境。   村上春树作品中方主要出版社和译者林少华老师携手，共同奉献村上春树长篇作品系列全新修订版。设计上与国际知名插画师Noma Bar合作，黑白红三色在方圆之间描摹出村上作品中的微妙迷离，总体呈现兼具简约和经典；内容上围绕外来语做了大量修订，还原原版中作家有意添加着重号的细节；林少华为多部作品更新译序 ，并对译文中的一些语气和表达做了细微调整；增补村上春树年谱至最新，每本书后附音乐列表。"
          },
        ]
      }
    ]
  }
}