export default {
  load() {
    return [
      {
        text: '政治军事',
        items: [
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/84/3300024284/t6_3300024284.jpg",
            "text": "毛泽东选集",
            "link": "https://weread.qq.com/web/bookDetail/2bb32ff0813ab6ffcg014315",
            "description": "毛泽东<br>这部选集，包括了毛泽东同志在中国革命各个时期中的重要著作。几年前各地方曾经出过几种不同版本的《毛泽东选集》，都是没有经过著者审查的，体例颇为杂乱，文字亦有错讹，有些重要的著作又没有收进去。现在的这部选集，是按照中国共产党成立后所经历的各个历史时期并且按照著作年月次序而编辑的。这部选集尽可能地搜集了一些为各地方过去印行的集子还没有包括在内的重要著作。选集中的各篇著人，都经著者校阅过，其中有些地方著者曾作了一些文字上的修正，也有个别的文章曾作了一些内容上的补充和修改。"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/54/yuewen_23523072/t6_yuewen_235230721689681600.jpg",
            "text": "中国历代政治得失",
            "link": "https://weread.qq.com/web/bookDetail/ffa323707166ef00ffa7080",
            "description": "钱穆<br>《中国历代政治得失》是钱穆先生的专题演讲合集，分别就中国汉、唐、宋、明、清五代种种政治制度作了提要钩玄的概观与比照，叙述因革演变，指陈利害得失。"
          },
        ]
      },
      {
        text: '经济理财',
        items: [
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/52/YueWen_40055543/t6_YueWen_40055543.jpg",
            "text": "置身事内：中国政府与经济发展",
            "link": "https://weread.qq.com/web/bookDetail/2a332d10726332f72a34943",
            "description": "兰小欢<br>本书是复旦大学经济学院教授兰小欢多年教学与研究内容的凝练，将经济学原理与中国经济发展的实践有机融合，以地方政府投融资为主线，深入浅出地论述了中国经济的发展，广泛采纳各领域学者全新研究成果。全书分上下两篇。上篇解释微观机制，包括地方政府的基本事务、收支、土地融资和开发、投资和债务等；下篇解释这些微观行为与宏观现象的联系，包括城市化和工业化、房价、地区差异、债务风险、国内经济结构失衡、国际贸易冲突等。最后一章通过对中国政治经济体系的论述，作者简明地刻画了地方政府进行经济治理的基本方式，指出中国政府通过深度介入工业化和城市化的进程，在发展经济的同时逐步推动了市场机制的建立和完善。"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/44/cpplatform_i6qbmwxvrnhr4t3hj4l2mu/t6_cpplatform_i6qbmwxvrnhr4t3hj4l2mu1736158997.jpg",
            "text": "持续买入",
            "link": "https://weread.qq.com/web/bookDetail/474328c0813ab9918g0157ba",
            "description": "[美] 尼克·马吉奥利<br>当我们谈到金钱时，每个人都想知道自己在储蓄、投资等财务决策上做得对不对。金融行业提供的许多答案常常基于观点和猜测，而不是数据和实证。 在本书中，数据科学家和投资专家尼克·马吉奥利通过数据分析引导我们客观地看待投资，构建正确的投资心态和理财方式。他建议我们不要只依靠直觉来投资或者盲目地接受投资建议，而要通过客观的数据分析来形成自己的投资策略。 作者提出了持续买入的投资策略，即什么时候买入资产、买多少、买什么资产都不重要，估值是高还是低不重要，处于牛市还是熊市也不重要——对积累财富来说，重要的是买入一组多样化的可创收资产，并且坚持持续买入。 只要持续买入，你的财富的雪球就会越滚越大。"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/77/YueWen_39280063/t6_YueWen_39280063.jpg",
            "text": "博弈论：每个人都能成为决策高手",
            "link": "https://weread.qq.com/web/bookDetail/5d332c2072575dbf5d33fe2",
            "description": "蒋文华<br>这是一本关于博弈论的入门书。蒋文华认为一个高度联结的社会必然是一个充满博弈的社会。要想在这样的社会里安身立命，我们每个人都需要博弈论的指导，让自己少挨刀或不挨刀。蒋文华提炼博弈论精华，用平实的语言和精彩的案例，带你走进博弈的认知世界，掌握博弈知识在工作生活中的巧妙应用。人生充满选择题，这本书博弈论普及读物帮你做对选择，实现共赢，用智慧答疑人生。"
          },
        ]
      },
      {
        text: '心理',
        items: [
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/86/YueWen_33628204/t6_YueWen_33628204.jpg",
            "text": "认知觉醒：开启自我改变的原动力",
            "link": "https://weread.qq.com/web/bookDetail/6a732ce07201202c6a7b30a",
            "description": "周岭<br>为什么我们做事总是急于求成、避难趋易？所谓有耐心，就是要“咬牙坚持、死磕到底”？如何不再用“三分钟热情”和“打鸡血”的方式做事？如何保持极度专注？如何消除焦虑？如何提高学习能力？这是一部可以穿透时间的个人成长方法论。7大底层概念，20个成长关键词，助你彻底走出焦虑与迷茫，拥有清醒的认知、清楚的目标、清晰的路径、清爽的情绪。通过“大脑构造、潜意识、元认知”等思维规律，你将真正看清自己；通过“深度学习、关联、反馈”等事物规律，你将真正看清世界，提升自控力、专注力、学习力……只有洞悉底层的内在规律，我们才能真正开启自我改变的原动力。"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/89/cpplatform_5m7j6mw2t6q8xamtgbr4eh/t6_cpplatform_5m7j6mw2t6q8xamtgbr4eh1675067330.jpg",
            "text": "不原谅也没关系",
            "link": "https://weread.qq.com/web/bookDetail/5a832b90813ab78dag016aaa",
            "description": "[美] 皮特·沃克<br>创伤事件不仅仅包括偶发的、严重的刺激性事件（如战争、天灾、恐怖事件），还包括在成长过程中遭受的羞辱、贬低、欺凌、背叛、情感忽视、过度控制等伤害。这些伤害或许你难以诉说，但带来的创伤却可能远甚于单一事件。有太多的人因为忽略了这样成长过程中的创伤，“莫名”地产生了人际关系障碍、情绪上的痛苦，甚至被误诊为边缘型人格障碍、自恋型人格障碍、焦虑症、抑郁症、强迫症……"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/385/25615385/t6_25615385.jpg",
            "text": "被讨厌的勇气：“自我启发之父”阿德勒的哲学课",
            "link": "https://weread.qq.com/web/bookDetail/8b9329607186dc198b9bdab",
            "description": "[日] 岸见一郎 [日] 古贺史健<br>获得真正的自由需要有被讨厌的勇气<br>一名深陷自卑、无能与不幸福的青年，听到了一名哲人主张的“世界无比单纯，人人都能幸福”便来挑战，两人展开了你来我往的思考和辩论，在一夜一夜过去后，青年开始思考，为什么“所谓的自由，就是被别人讨厌”？问题不在于世界是什么样子，在于你是什么样子。"
          },
        ]
      },
      {
        text: '个人成长',
        items: [
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/18/cpplatform_64vbj5nltlbw9xvjhdjepa/t6_cpplatform_64vbj5nltlbw9xvjhdjepa1754388195.jpg",
            "text": "深度思考：前香奈儿CEO的成功法则",
            "link": "https://weread.qq.com/web/bookDetail/f3332130813aba381g013a3a",
            "description": "[美] 莫琳·希凯<br>前香奈儿全球CEO莫琳·希凯以非凡的职业转型和个人成长经历为核心，讲述了一个从文学专业背景出发，最终站在全球商业巅峰的不平凡故事。 在这个被无数标签和刻板印象包围的世界，莫琳·希凯以亲身经历挑战了外界对个人潜能与成功的既有认知。她不仅勇敢地挣脱了传统职业路径的束缚，更激励了每位读者超越标签，探索并定义真正属于自己的成功。她以细腻的笔触和深刻的洞察力，分享了在职业生涯中的种种挑战、抉择与蜕变，以及这些经历如何塑造她的核心价值观。这些生动的故事引导我们深度思考：如何在复杂多变的现代社会中保持自我、追求卓越，在竞争激烈的环境中创造属于自己的成功与幸福。 这本书是献给每一位不甘平庸的读者的珍贵礼物，它鼓励所有渴望成功与自由、追求梦想与自我实现的人，去拥抱每一种可能性，活出属于自己的精彩人生。"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/32/yuewen_26406758/t6_yuewen_264067581720754472.jpg",
            "text": "人间值得",
            "link": "https://weread.qq.com/web/bookDetail/0f8325307192ef660f8c2f7",
            "description": "[日] 中村恒子 [日] 奥田弘美<br>未来岁月漫长，依旧值得期待 人如何度过一生，才不会辜负生命？面对人生的终极问题，当了70年心理医生的作者中村恒子，将其90年的人生智慧，化为本书六大篇章关于工作、爱、人际关系、幸福、死亡等课题的诚挚箴言，陪同数不清的人走过人生泥泞的时期，让他们在认清生活真相后，仍然有热爱生活的勇气。作者娓娓道来的讲述，总有一句令你豁然开朗，消解心头烦忧，感受生命的力量，让你意识到“这是你自己的人生”，只要活出自己，就会发现“人间值得”。"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/60/YueWen_36721755/t6_YueWen_36721755.jpg",
            "text": "别想太多啦",
            "link": "https://weread.qq.com/web/bookDetail/2de322e07230545b2de9d3b",
            "description": "[日] 名取芳彦<br>很多时候，别人没那么在意你，因为害怕被讨厌、期待被喜欢，然而你不知道，根本没有人讨厌你。你“小小的期待”不敢说出口，变成压抑委屈的庸人自扰；想得太多、内心充满担忧，累积成难以承受的精神压力。人生中，有很多事情最好不要放在心上。要想成为“不在意的人”，需要一点小小的练习。日本超人气禅师名取芳彦，对日常生活中的烦恼，进行身临其境的分析，104个“别想太多”的练习，让人不再忧郁、焦躁、闷闷不乐……"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/22/3300011622/t6_3300011622.jpg",
            "text": "底层逻辑：看清这个世界的底牌",
            "link": "https://weread.qq.com/web/bookDetail/73132fa0813ab6b0ag012a5b",
            "description": "刘润<br>如果只教给你各行各业的“干货”（方法论），那只是“授人以鱼”，一旦环境出现任何变化，“干货”就不再适用。但如果教给你的是底层逻辑，那就是“授人以渔”，你可以通过不变的底层逻辑，推演出顺应时势的方法论。所以，只有掌握了底层逻辑，只有探寻到万变中的不变，才能动态地、持续地看清事物的本质。在这本书中，我把在《5分钟商学院》中讲述的底层逻辑的内容进行了总结，与你分享是非对错、思考问题、个体进化、理解他人、社会协作五个方面的底层逻辑，带你看清世界的底牌。"
          },
        ]
      },
      {
        text: '医学健康',
        items: [
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/86/YueWen_920661/t6_YueWen_920661.jpg",
            "text": "你是你吃出来的：吃对少生病，病了这样吃",
            "link": "https://weread.qq.com/web/bookDetail/7bb32c305e0c557bbdeab81",
            "description": "夏萌<br>《你是你吃出来的》是前安贞医院营养科主任夏萌总结自身患病经历和10万+临床病例写成。高血压、高血脂、糖尿病、冠心病等慢病人群都曾陷入同一个误区——误以为低油低脂保健康，其实多是蛋白质缺乏式营养不良；误以为只能终生服药或手术，忽略了饮食等生活方式改变带来的真正康复。作者结合实例提出：要预防疾病，先回到史上人类进化突飞猛进阶段的食谱——{植物类食物65%+动物类食物35%}，一日三餐才是真正的保健品；针对已患慢病人群，提出“四分法”，讲解冠心病、甲状腺结节、胃炎、心悸、便秘、高血压、痛经、抑郁、老年痴呆14种常见慢病饮食治病方法，帮助患者控制疾病和恢复健康。中国人到底怎样吃才健康？一本书重建健康饮食新认知——吃对少生病，病了这样吃。"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/883/35905883/t6_35905883.jpg",
            "text": "你是你吃出来的2",
            "link": "https://weread.qq.com/web/bookDetail/40532d007223e15b4052fae",
            "description": "夏萌<br>本书是一本针对高血压、高脂血、糖尿病、痛风等慢病患者、亚健康人群从临床医学角度提出营养治病调理思路和方案的临床营养实践类图书。营养专家夏萌老师总结几十年临床经验，从营养学角度辨别诊治多种慢病和亚健康的成因，破除营养认知误区，深入浅出地剖析疾病的饮食根源，带给慢病患者科学的营养指导。书中讲解了多个大众饮食误区，比如血压高不能吃肉？尿酸高不能吃海鲜？胆固醇高不能吃鸡蛋？血糖高不能吃水果？吃得越好肿瘤长得越快？喝牛奶会加重肾脏负担？等等，简单实用，旨在帮助读者通过一日三餐预防疾病、调理不适，掌握慢病康复的饮食密码。"
          },
        ]
      },
      {
        text: '文学',
        items: [
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/66/cpplatform_ev8stfj5zfgfny1ddve1nu/t6_cpplatform_ev8stfj5zfgfny1ddve1nu1684925171.jpg",
            "text": "夜晚的潜水艇",
            "link": "https://weread.qq.com/web/bookDetail/93e32750813ab7dd0g0169dc",
            "description": "陈春成<br>《夜晚的潜水艇》是作家陈春成的首部短篇小说集。九个故事，笔锋游走于旧山河与未知宇宙间，以瑰奇飘扬的想象、温厚清幽的笔法，在现实与幻境间辟开若干条秘密的通道：海底漫游的少年、深山遗落的古碑、弥散入万物的字句、云彩修剪站、铸剑与酿酒、铁幕下的萨克斯、蓝鲸内的演奏厅……潜入故事深处，感知体内的星云旋动、草木蔓发；以词语的微光，探照记忆的海沟。关于藏匿与寻找、追捕与逃遁，种种无常中的一点确凿，烈日与深渊间的一小片清凉。陈春成的小说世界，是可供藏身的洞窟，悬浮于纸上的宫殿，航向往昔的潜艇，呈现汉语小说的一种风度与新的可能性。"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/82/cpplatform_qjyzmm2uxy4tye6snkabcm/t6_cpplatform_qjyzmm2uxy4tye6snkabcm1754015660.jpg",
            "text": "瓦尔登湖",
            "link": "https://weread.qq.com/web/bookDetail/4ad32b30813aba337g0138ea",
            "description": "[美] 亨利·戴维·梭罗<br>超验主义经典作品《瓦尔登湖》，在美国文学中被公认为最受读者欢迎的非虚构作品。 作者梭罗在瓦尔登湖畔亲手搭建木屋，度过了两年零两个月的独居时光。他开垦土地、种植豆类，记录黎明湖面的薄雾、冬日冰层的裂纹，在劈柴、做饭的琐事里，剥离世俗的冗余与浮躁。 文字里既有泥土的芬芳，也有锋利的哲思：批判物质主义的虚妄，追问 “人究竟需要多少物质才能生存”；在松鼠偷食坚果、野雁掠过水面的瞬间，照见自然与灵魂的共鸣。 这不是逃避现实的隐居，而是一场清醒的生活实验。每一页都像湖畔的阳光，既能晒干焦虑的水汽，也能照亮内心对简单与自由的渴望。"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/60/cpplatform_n3ezmfhymkjcbuuszk8bgy/t6_cpplatform_n3ezmfhymkjcbuuszk8bgy1731488438.jpg",
            "text": "不被大风吹倒",
            "link": "https://weread.qq.com/web/bookDetail/2c032e80813ab95aag019524",
            "description": "莫言<br>卷也好，躺也好，不被大风吹倒就好！ 莫言新书！聊聊如何面对人生的艰难时刻！ 本书收录了莫言40篇散文，从家人与朋友、童年与成长、读书与写作等角度展现了莫言的人生态度和对人生艰难时刻的感悟。 收录《我的室友余华》，讲述莫言和余华相爱相杀的故事。 莫言全新创作《忆史铁生》，回忆他和余华带着史铁生偷黄瓜、踢足球让史铁生当守门员的故事。 其中《不被大风吹倒》这篇散文是莫言在五四青年节时给年轻人的寄语，讲述了小时候和爷爷在大坝上遇到大风、爷爷抵抗大风的故事，鼓励年轻人遇到人生的艰难时刻时不要放弃。"
          },
        ]
      },
      {
        text: '历史',
        items: [
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/37/YueWen_855812/t6_YueWen_855812.jpg",
            "text": "人类简史：从动物到上帝",
            "link": "https://weread.qq.com/web/bookDetail/d4a322a05d0f04d4a01f0d6",
            "description": "尤瓦尔·赫拉利<br>十万年前至少有六种人，为什么只剩我们<br>10万年前，地球上至少有6个不同的人类物种，但今天只剩下1个，就是我们智人。究竟发生了什么，让其他人类物种都消失了？我们智人又将会怎样？ 以色列著名历史学家尤瓦尔·赫拉利开创性地将历史和科学结合起来，讲述了从宇宙大爆炸至今智人历史的完整故事。尤瓦尔·赫拉利教授认为，在智人从一种不起眼的动物到地球主宰者的漫长演化史上，发生了三次关键性的革命：认知革命、农业革命和科学革命。认知革命让智人拥有了创造想象秩序和虚构故事的能力，彻底超越了其他物种；农业革命让智人从狩猎-采集生活走向定居生活，生活方式和社会组织发生了革命性的转变；科学革命让智人成为神一样的“造物主”，获得整个地球的统治地位。 尤瓦尔·赫拉利教授还提示我们向前看，因为在过去的几十年里，我们已经开始违背自然选择的法则，而自然选择的法则在过去的40亿年里都一直是生命遵循的法则，今天的我们不仅获得了设计周围世界的能力，也获得了设计我们自己的能力，这将引领我们走向何方，我们想成为什么样的人类？是时候重新定义“人类”了。 《人类简史》是一部全球畅销书，摒弃了旧的解释框架，提出了颠覆性的创见，让我们对自身的存在有了全新的认知。"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/23/yuewen_23774475/t6_yuewen_237744751687158200.jpg",
            "text": "曾国藩传（张宏杰全新增补版）",
            "link": "https://weread.qq.com/web/bookDetail/66032040716ac50b660b6c7",
            "description": "张宏杰<br>一个持续奋斗者的升级之道。<br>曾国藩，没有显赫的家世，天赋堪称晚清同时代大人物当中最差，却官至两江总督、直隶总督、武英殿大学士，在复杂的时代变局中超越众人，成就最大，被誉为大清“中兴第一名臣”，且最后全身而退。他的人生经历，无论是过去还是现在都给人以特别的启示。 他出身平常，家族五六百年没出过秀才，可谓典型的小镇青年。 他智商平常，考了7次才中秀才，却以笨功夫成功打通了科举之路，顺利进入翰林院。他一生崇尚笨拙，以扎实而非机巧取胜。 他踌躇满志进京，面对全国精英，发现自己见识狭隘、观念鄙俗，陷入自卑和焦虑。三十而立，他立志学做圣人，研读经典，广交朋友，提高自我管理能力，在京期间飞速升迁。 他善于把握机会和创造机会，天下大乱之际，一介书生独创湘军，统率群雄。对抗太平天国，屡战屡败，甚至两次投江自尽，多次深陷绝境。47岁时更被皇帝弃用，陷入人生低谷。 蛰居老家两年，他反思自我，最终大悔大悟。重新出山后，为人处世脱胎换骨，不仅清除了政治敌人，而且以“结硬寨、打呆仗”战胜了军事宿敌太平天国，位极人臣。 他眼光长远，审时度势，面对与洋人的差距，率先抛弃落后观念，倡导洋务运动，师夷长技以制夷。 他走过的每一步都成为人生精进的基石，最终从笨人到圣人，成为大清王朝的最后领航者和儒家文化的最后一个偶像。 翻开本书，看曾国藩如何以一种笨拙的精神，诠释一个持续奋斗者的升级之道。"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/844/34560844/t6_34560844.jpg",
            "text": "一读就上瘾的中国史",
            "link": "https://weread.qq.com/web/bookDetail/8ac32ef0720f5b4c8ac9ad3",
            "description": "温伯陵<br>一个杨贵妃，在李白眼里是“云想衣裳花想容，春风拂槛露华浓”；在杜牧眼里是“一骑红尘妃子笑，无人知是荔枝来”；而在罗隐眼里，则是“泉下阿蛮应有语，这回休更怨杨妃”。美女、宠妃、败家娘们儿以及背锅女侠，哪一个才是真的杨贵妃？一座长安城，在汉唐，是无可取代的帝国中枢，是王维笔下的“万国衣冠拜冕旒”；在宋朝，却成了边境军镇；而在明朝末年，又沦为饥荒遍地、易子而食的人间地狱。温伯陵的文章，既有细节故事，又有历史大局观，惊险刺激，一读就上瘾。在温伯陵笔下，历史不再是按时间码放的记事簿，而是贯通时间、看清脉络的时代演变过程。用他的方法来读历史，你将发现历史背后的那只手，彻底看懂历史的过去、现在和未来。"
          },
        ]
      },
      {
        text: '社会文化',
        items: [
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/40/3300012940/t6_3300012940.jpg",
            "text": "法治的细节",
            "link": "https://weread.qq.com/web/bookDetail/be832770813ab6b8eg01004a",
            "description": "罗翔<br>《法治的细节》是中国政法大学法学教授罗翔全新的法学随笔，面向大众读者，从热点案件解读、法学理念科普、经典名著讲解等6大板块，普及法律常识与法治观念。内容包括辛普森案、电车难题、性同意制度等法律基本常识，或N号房、张玉环案等时事热点的案件，多维度培育法律思维，助力法治社会的构建，点亮每个人心中的法治之光。 此外，本书还收录了罗翔在爆红后的心路历程，分享其求学成长经历，袒露其心境的变化与成熟，与读者一起通过阅读与思辨，走出生活中的迷茫时刻，在现实中共同完善法治的细节。"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/732/40457732/t6_40457732.jpg",
            "text": "圆圈正义：作为自由前提的信念",
            "link": "https://weread.qq.com/web/bookDetail/739322a07269560473951d3",
            "description": "罗翔<br>《圆圈正义》一书共收录作者的49篇随笔文章，分为“圆圈正义”“何谓榜样”“道德谴责的打开方式”“身负权力各自珍重”“法律人的理智和多数人的情感”“生命的尊严”“心怀永恒活在当下”七大部分，作者在本书中运用特有的坦诚、自省而尖锐的笔调，探讨了法律、正义、道德、权力的理念与现实、分析了如张扣扣案、莫某纵火案等社会热点案件、分享了自身求学经验和对人生的思考。本书不仅启蒙读者法律意识和法治观念，更在于帮助读者理解法律背后更深层次的价值基础。"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/99/YueWen_42766048/t6_YueWen_42766048.jpg",
            "text": "枪炮、病菌与钢铁",
            "link": "https://weread.qq.com/web/bookDetail/843329f0728c8ee08434fb1",
            "description": "贾雷德·戴蒙德<br>文明的先发与落后，社会的发展与倒退等问题，一直是人类关注的大议题。就此，西方社会普遍认为西方国家先进的技术、完善的社会阶层、百花齐放的文化成果，共同造就了西方文明优于其他，并决定了西方统治世界的地位，甚至认为究其根本是西方种族的优越性决定的。《枪炮、病菌与钢铁》告诉我们，答案并非如此。环境因素才是决定历史的车轮向西方倾斜倾，文明的进步的确助推了文化、技术和组织的先发，但同时也导致了细菌的侵袭和船坚利炮对文明的致命摧毁，也就是说，种族决定论和西方文明优势论都无法解释为什么西方国家可以统治世界百年之久。是环境与资源的优渥滋养了西方文明的发展。此外，戴蒙德从生物学、地理学、历史学、社会学、人类学等跨学科视角颠覆了很多人们习以为常的社会发展疑问，为我们理解人类历史提供了崭新的视角。从深耕专业领域的科学家，到关注人类社会与命运的思想者，戴蒙德从科学、历史、社会的交叉点探究地理、人类与未来，他在某种程度上代表了西方公共知识分子传统的转向——从专业性转向思想性，他依仗多学科的视角和丰富的游历经验，追思人类历史的发展路径，从中寻找经验与教训，试图为人类社会未来的发展提供建议。"
          },
        ]
      },
      {
        text: '精品小说',
        items: [
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/75/cpPlatform_dbb14284a55f1e733b60202b0777255d/t6_cpPlatform_dbb14284a55f1e733b60202b0777255d.jpg",
            "text": "长安的荔枝（同名影视原著）",
            "link": "https://weread.qq.com/web/bookDetail/cc932860813ab67c2g014597",
            "description": "马伯庸 #历史小说<br>大唐天宝十四年，长安城小吏李善德突然接到一个任务：要在贵妃诞日之前，从岭南运来新鲜荔枝。荔枝保鲜期只有三天，而岭南距长安五千余里，山水迢迢，这是个不可能完成的任务。为了家人，李善德只得放手一搏…… 古装版社畜求生记，帝国夹缝中的小人物史诗。"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/43/3300024943/t6_3300024943.jpg",
            "text": "一句顶一万句",
            "link": "https://weread.qq.com/web/bookDetail/3de32670813ab703eg013597",
            "description": "刘震云 #社会小说<br>《一句顶一万句》是作家刘震云创作于2006年到2008年的长篇小说，2011年8月获得第八届茅盾文学奖。小说的主题是讲“一个人想找另一个人说句话不容易”。"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/66/cpplatform_ixqq6ukpugs2vqt1nvqycn/t6_cpplatform_ixqq6ukpugs2vqt1nvqycn1721815265.jpg",
            "text": "我胆小如鼠",
            "link": "https://weread.qq.com/web/bookDetail/276323e0813ab90a5g0144d7",
            "description": "余华 #社会小说<br>余华献给被原生家庭伤害过的孩子的自传，看完从胆小怯懦变得松弛强大！ 余华：我曾是千千万万个敏感怯懦的孩子中的一个，这是我们共同的自传！ 有一句成语叫胆小如鼠，说的就是我的故事。 本书收录余华创作的《我胆小如鼠》《夏季台风》《四月三日事件》《一个地主的死》四篇中篇小说。这些作品包含着余华的成长经验，淋漓尽致地呈现了每个人在青春期可能会经历的敏感、自卑和怯懦，让无数挣扎在人生转折期的年轻人产生了共鸣。"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/12/cpplatform_27ztfi8zjc17r4ruzuxfws/t6_cpplatform_27ztfi8zjc17r4ruzuxfws1686221000.jpg",
            "text": "刺杀骑士团长",
            "link": "https://weread.qq.com/web/bookDetail/3a832bc0813ab7e67g0178e2",
            "description": "[日] 村上春树 #情感小说<br>“哪怕云层再黑再厚，背面也银光闪闪。”  关于创伤、内省、对峙、重生的力量之作，面对无法挽回的失去，直面无以名之的恶。  科班出身的“我”原本爱好抽象画，为了养家糊口成为专业肖像画画家。结婚六周年纪念日前夕，妻子突然坦言已有外遇，要求离婚，于是“我”独自开车离家开车，最终应好友雨田政彦之邀，住进小田原郊外山间其父雨田具彦的旧居兼画室，调整身心。   “我”在山下的绘画板任教时和班里的两位人妻先后成了情人，经神秘邻居免色的精心策划,和少女真理惠也建立了密切联系。   房主雨田具彦原是著名画家，“我”意外在阁楼发现了一幅雨田具彦不为世人所知的大师级作品，名为“刺杀骑士团长”，就此打开一段尘封的历史。   之后，“我”被卷入一系列不可思议的事件……   夜半铃声与古庙洞口、神秘邻居免色涉与绘画班女学生秋川真理惠、“骑士团长”与“长面人”、现实世界与隐喻世界……   村上春树用他擅长的层层剥开的写法，将读者步步引入奇妙之境。   村上春树作品中方主要出版社和译者林少华老师携手，共同奉献村上春树长篇作品系列全新修订版。设计上与国际知名插画师Noma Bar合作，黑白红三色在方圆之间描摹出村上作品中的微妙迷离，总体呈现兼具简约和经典；内容上围绕外来语做了大量修订，还原原版中作家有意添加着重号的细节；林少华为多部作品更新译序 ，并对译文中的一些语气和表达做了细微调整；增补村上春树年谱至最新，每本书后附音乐列表。"
          }
        ]
      },
      {
        text: '刘慈欣 科幻小说作品集',
        items: [
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/80/yuewen_695233/t6_yuewen_6952331677562148.jpg",
            "text": "三体（全集）",
            "link": "https://weread.qq.com/web/bookDetail/ce032b305a9bc1ce0b0dd2a?",
            "description": "刘慈欣<br>每个人的书架上都该有套《三体》！关于宇宙最狂野的想象！就是它！征服世界的中国科幻神作！包揽九项世界顶级科幻大奖！出版16个语种，横扫30国读者！奥巴马、雷军、马化腾、周鸿袆、潘石屹、扎克伯格……强推！刘慈欣获得2018年度克拉克想象力贡献社会奖！刘慈欣是中国科幻小说的最主要代表作家，亚洲首位世界科幻大奖“雨果奖”得主，被誉为中国科幻的领军人物。"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/88/YueWen_25504039/t6_YueWen_25504039.jpg",
            "text": "三体前传：球状闪电",
            "link": "https://weread.qq.com/web/bookDetail/6b832220718529276b89a0a?",
            "description": "刘慈欣<br>没有《球状闪电》，就没有后来的《三体》！《三体》前传！亚洲首位雨果奖得主刘慈欣的三大长篇之一！（《三体》《球状闪电》《超新星纪元》）《球状闪电》拥有最狂野的想象力！带你从另一个维度观察世界！全面展现刘慈欣对人生的终极思考！《三体》中解决可控核聚变的顶级物理学家丁仪，正是《球状闪电》中找到球状闪电的关键人物。《三体》中一号面壁人的幽灵军队计划，正是来自于《球状闪电》。《球状闪电》中的疑似宇宙观察者，为《三体》中的智子出现铺陈了线索。《球状闪电》和《三体》是刘慈欣两个不同时期的巅峰之作，《球状闪电》是他对人生的终极思考，《三体》则是他对宇宙的终极思考。过一个美妙的人生并不难，关键在于你迷上的是什么。某个离奇的雨夜，一颗球状闪电在一瞬间将少年的父母化为灰烬，而他们身下的板凳却分毫无损。从此少年踏上了研究球状闪电的旅程，死亡者的幽灵笔迹、前苏联的地下科技城、次世代的世界大战……球状闪电意外成为了战争中决定祖国存亡的终极武器！一个从未有人想像过的未来，在宇宙观察者的注视下，悄然降临在人类面前……"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/387/25135387/t6_25135387.jpg",
            "text": "流浪地球",
            "link": "https://weread.qq.com/web/bookDetail/4db32510717f891b4dbdaca?",
            "description": "刘慈欣<br>刘慈欣的短篇小说构思巧妙，想象力纵横恣肆，将坚实的科学基础以及厚重的人文关怀隐藏在灵动精致的故事结构中。本集精选出刘慈欣的十一篇短篇小说，其中《朝闻道》《流浪地球》《乡村教师》《中国太阳》《全频带阻塞干扰》均获银河奖。《流浪地球》《乡村教师》已被改编为电影。《带上她的眼睛》入选人教版七年级下学期《语文》教材。本书封面插画为《流浪地球》同名电影海报。"
          },
        ]
      },
      {
        text: '推理小说女王 - 阿加莎.克里斯蒂 作品集',
        items: [
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/63/yuewen_728514/t6_yuewen_7285141680854106.jpg",
            "text": "无人生还（同名英剧原著）",
            "link": "https://weread.qq.com/web/bookDetail/d6332fd05b1dc2d63df8938?",
            "description": "阿加莎·克里斯蒂<br>十个相互陌生、身份各异的人受邀前往德文郡海岸边一座孤岛上的豪宅。客人到齐后，主人却没有出现。当晚，一个神秘的声音发出指控，分别说出每个人心中罪恶的秘密。接着，一位客人离奇死亡。暴风雨让小岛与世隔绝，《十个小士兵》——这首古老的童谣成了死亡咒语。如同歌谣中所预言的，客人一个接一个死去……杀人游戏结束后，竟无一人生还！"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/92/yuewen_728522/t6_yuewen_7285221680854077.jpg",
            "text": "罗杰疑案",
            "link": "https://weread.qq.com/web/bookDetail/2ce329305b1dca2ceb95926?",
            "description": "阿加莎·克里斯蒂<br>金斯艾伯特村里坐落着两座豪宅，“皇家围场”是其中之一，而居住其中的弗拉尔斯太太刚刚过世。此后不久，她的情人，也就是住在另一所大宅里的罗杰·艾克罗伊德先生便得知，弗拉尔斯太太一年前杀害了自己的丈夫，最终因愧疚而自杀。更重要的是，罗杰还发现她在死之前一直被一个神秘人敲诈。他展开她最后的来信，打算读出那个人的名字，可惜没有人听到。因为一把短剑插进了他的后颈……"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/53/yuewen_728497/t6_yuewen_7284971680854100.jpg",
            "text": "东方快车谋杀案",
            "link": "https://weread.qq.com/web/bookDetail/603327a05b1db160313dacf?",
            "description": "阿加莎·克里斯蒂<br>11月10日，《东方快车谋杀案》时隔43年再度被搬上大银幕，肯尼思·布拉纳、佩内洛普·克鲁兹、威廉·达福 、朱迪·丹奇、约翰尼·德普等众多顶级演员出演。1974年，英格丽·褒曼凭借本书改编的同名电影获得奥斯卡奖，英国女王出席该片首映礼。本书以1932年轰动一时的真实案件“林白之子绑架案”为蓝本，淋漓极致展现了作者刻画人物群像的深厚功力。侦探波洛在叙利亚完成了一项委托，要搭乘辛普朗号东方快车回国。奇怪的是，似乎全世界的人都选在那一夜出行，这列铺位一向宽裕的豪华列车竟然一票难求。幸好他遇到了好友、国际客车公司的董事布克先生，这才挤上了车。午夜过后，一场大雪迫使辛普朗号停了下来。第二天一早，大家发现少了一名乘客。一个美国人死在了他的包厢里，被刺了十二刀，可他包厢的门却是反锁的。随着调查的深入，案情却似乎更加扑朔迷离，大侦探波洛想出了两种截然不同的解释……"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/508/728508/t6_728508.jpg",
            "text": "尼罗河上的惨案",
            "link": "https://weread.qq.com/web/bookDetail/07c321b05b1dbc07cdb1288?",
            "description": "阿加莎·克里斯蒂<br>琳内特·里奇卫拥有一切——年轻、美貌、过人的头脑，而且还继承了巨额财产。但出乎所有人的意料，她闪电般地与自己的地产经纪人，也就是好友杰奎琳的男友多伊尔结了婚。婚后幸福的二人决定去埃及度蜜月。决意复仇的杰奎琳、偷偷在琳内特财产上做了手脚的律师，以及其他许多似乎是外人的游客，与他们登上了同一条船。"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/37/yuewen_728509/t6_yuewen_7285091680854028.jpg",
            "text": "帷幕",
            "link": "https://weread.qq.com/web/bookDetail/3a4328105b1dbd3a43d7b54?",
            "description": "阿加莎·克里斯蒂<br>波洛与挚友黑斯廷斯的探案生涯回到了原点，他们再次相聚于斯泰尔斯庄园——正是在这里，初到英国的波洛解决了第一起谋杀案。"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/93/YueWen_22289907/t6_YueWen_22289907.jpg",
            "text": "牙医谋杀案",
            "link": "https://weread.qq.com/web/bookDetail/4be3229071541df34bea4eb?",
            "description": "阿加莎·克里斯蒂<br>一，二，扣住鞋；三，四，关紧门；五，六，衔树枝；七，八，理顺它；九，十，肥母鸡；十一，十二，深探究；十三，十四，女求偶；十五，十六，厨娘们；十七，十八，在等待；十九，二十，终散席。看牙医是种怎样恐怖的体验？大侦探波洛在前往莫利医生的诊所做牙科检查时，他的自信心一度降到了零。没料到，数小时后莫利医生在诊室里自杀身亡。为何一名牙医会在一个繁忙的工作日里选择自杀？一只鞋的鞋扣成为破案的关键。现在，诚如童谣所说，波洛能挑拣出有用的树枝，把它们筑成一个鸟巢吗？"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/98/YueWen_24058391/t6_YueWen_24058391.jpg",
            "text": "三幕悲剧",
            "link": "https://weread.qq.com/web/bookDetail/869322a0716f1a178694449?",
            "description": "阿加莎·克里斯蒂<br>一向镇定自若的赫尔克里·波洛正面临侦探生涯中最难解的案件——犯罪动机？不存在。毒物？不知所终。萨特思韦特先生——那位人生舞台上的旁观者再次出现，抢走了伟大侦探的不少风头。一个不知天高地厚的天真少女，两位温文尔雅的年长绅士，三名毫无关联的无辜死者。相似的戏码交替上演，悲剧从一场注定变成诅咒的十三人晚宴开始，徐徐拉开序幕……"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/51/yuewen_728495/t6_yuewen_7284951680854085.jpg",
            "text": "ABC谋杀案",
            "link": "https://weread.qq.com/web/bookDetail/d0f328105b1dafd0f419a10?",
            "description": "阿加莎·克里斯蒂<br>“那就让我们看看，聪明的波洛先生到底有多聪明。”化名ABC的连环杀人狂按照列车时刻表的字母顺序，一步步实施杀人计划。他狂妄地向波洛发出挑战书，整个英国因此陷入恐慌。A：安德沃尔，B：贝克斯希尔，C：彻斯顿……每成功犯下一条命案，凶手就更为自信，而波洛，似乎总是迟到了一步。"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/881/22289881/t6_22289881.jpg",
            "text": "阿加莎·克里斯蒂自传",
            "link": "https://weread.qq.com/web/bookDetail/f1b3296071541dd9f1b2ce4?",
            "description": "阿加莎·克里斯蒂<br>全世界都知道她是侦探小说女王，熟识她笔下的名侦探、有趣的故事，以及曾神秘失踪两星期。而身为善于描绘的作家，她如何讲述自己的一生？作为女性：从淘气儿童到魅力少女，从女儿妹妹到妻子母亲，从对爱失望到重获幸福。阿加莎那些优雅的建议如今听来依旧时髦、实用。作为作家：从兴趣爱好到职业，作品渐渐畅销，并开创新的创作领域。阿加莎对立志入此行的年轻人的教诲句句发自肺腑。作为旅行爱好者：与爱人周游世界，独自踏入东方，不同心境的阿加莎开出超个性攻略。作为一个英国人：经历两次世界大战的阿加莎，对祖国怀有深情的守护、对战争心怀入骨的憎恨。读过她的书，再认识这个人。"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/62/yuewen_728513/t6_yuewen_7285131680853813.jpg",
            "text": "斯泰尔斯庄园奇案",
            "link": "https://weread.qq.com/web/bookDetail/41332ae05b1dc14139fb29d?",
            "description": "阿加莎·克里斯蒂<br>斯泰尔斯庄园的女主人英格尔索普太太掌管着财政大权。某日凌晨，她在自己的房间里毒发身亡，而房间的三个门都是从里面锁上的。侦探波洛在调查此案的过程中发现了一系列疑点，但最大的疑犯——英格尔索普太太的丈夫却有不在场的证据。最让波洛感到头痛的是，庄园里的每个人似乎都隐瞒了什么。"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/499/728499/t6_728499.jpg",
            "text": "五只小猪",
            "link": "https://weread.qq.com/web/bookDetail/b8232f905b1db3b82bfeccd?",
            "description": "阿加莎·克里斯蒂<br>年轻的卡拉小姐在结婚前夕被告知自己的身世——十六年前她的父亲被杀，而她的母亲被当做杀人凶手死在狱中。大为震惊的同时，她也收到了母亲临死前留给她的信，信中坚称自己不是凶手。困惑的卡拉找到波洛，希望查明真相。波洛走访了五位当年的见证人，从他们的叙述中还原出了一幅耐人寻味的画卷……"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/15/YueWen_24139770/t6_YueWen_24139770.jpg",
            "text": "清洁女工之死",
            "link": "https://weread.qq.com/web/bookDetail/7ab32880717057fa7ab0cfe?",
            "description": "阿加莎·克里斯蒂<br>清洁女工麦金蒂太太毫无征兆地离奇被害。凶手残忍地敲碎了她的后脑勺。性格古怪的房客詹姆斯·本特利立即成为了疑点最大的嫌疑犯。他的衣服上粘有被害人的血迹和头发。然而，经验丰富的斯彭斯警监并不认为他是杀人凶手。真相能否从命案发生两天前的一张剪报中找到？绝命杀手依然逍遥法外。伟大的侦探赫尔克里·波洛必须提防种种不测，拼出这幅凌乱的拼图，以找出真凶……"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/19/YueWen_24139774/t6_YueWen_24139774.jpg",
            "text": "死亡草",
            "link": "https://weread.qq.com/web/bookDetail/10332b80717057fe1037168?",
            "description": "阿加莎·克里斯蒂<br>神舍前高举双臂的美艳女祭司，密室中预示厄运的蓝色报春花，石板路上突然出现的血迹，自称能占卜未来的神秘通灵师，离奇消失的遗嘱，被嫉妒和占有欲支配的死亡之草……星期二晚间俱乐部的成员们围坐在一起，轮流讲述发生在自己身边的谜案，只有亲爱的马普尔小姐每次都能直指真相。"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/527/728527/t6_728527.jpg",
            "text": "阳光下的罪恶（同名电影原著）",
            "link": "https://weread.qq.com/web/bookDetail/810321205b1dcf81096b6d1?",
            "description": "阿加莎·克里斯蒂<br>阿加莎·克里斯蒂编著的《阳光下的罪恶（阿加莎·克里斯蒂作品）》讲述了这样一个故事，艾莲娜·马歇尔太太是海盗旗旅馆中最令人瞩目的客人。在众多仰慕者中，她很快和英俊的帕特里克·雷德芬如胶似漆。雷德芬太太为此伤心愤怒，马歇尔先生却不动声色。好戏刚刚开幕，艾莲娜却失踪了，直到人们发现她美丽的躯体被遗弃在已经没有阳光的海滩上，脖子上留下了可怕的手印……"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/59/yuewen_728510/t6_yuewen_7285101680854092.jpg",
            "text": "底牌",
            "link": "https://weread.qq.com/web/bookDetail/98132de05b1dbe981cd7f85?",
            "description": "阿加莎·克里斯蒂<br>著名富商夏塔纳先生邀请波洛参加一次特殊的私人聚会，同时还邀请了另外三位侦探，包括著名的侦探小说作家、苏格兰场的警司与政府密探。与此同时，到场的还有夏塔纳要展示的特别的收藏：四位完美的凶手。"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/512/728512/t6_728512.jpg",
            "text": "悬崖山庄奇案",
            "link": "https://weread.qq.com/web/bookDetail/fb8329105b1dc0fb8e09c59?",
            "description": "阿加莎·克里斯蒂<br>山崖上的古宅拥有一位年轻漂亮的主人：尼克·巴克利小姐。她热爱这幢祖屋，然而当她住在这里时却怪事频发，威胁到她的生命。她床头的油画莫名其妙地掉落，车子刹车突然失灵，走在小路上也差点被巨石砸中……"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/62/YueWen_728528/t6_YueWen_728528.jpg",
            "text": "高尔夫球场命案",
            "link": "https://weread.qq.com/web/bookDetail/e75329a05b1dd0e75f5b32c?",
            "description": "阿加莎·克里斯蒂<br>一封求救信让波洛来到了法国，然而他来得太迟了，因为他的委托人已经被人用裁纸刀刺死，面朝下躺在一座高尔夫球场上的墓穴中。为什么死者身上的大衣长出了一大截？大衣口袋里那封热情洋溢的情书又是写给谁的？波洛还没有来得及弄清楚这些问题，第二具尸体又以同样的方式出现了……"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/182/732182/t6_732182.jpg",
            "text": "沉默的证人",
            "link": "https://weread.qq.com/web/bookDetail/376323905b2c163768ffdec?",
            "description": "阿加莎·克里斯蒂<br>年迈富有的阿伦德尔小姐从楼梯上跌了下来。每个人都把事故原因归咎于小狗鲍勃留在楼梯顶层的皮球，可是阿伦德尔小姐越想越觉得不对劲儿，她相信这不是一起意外，而是某个血亲试图谋杀她。阿伦德尔小姐把自己的怀疑写下来寄给波洛。这封语焉不详的信马上引起了波洛的兴趣，但他永远失去了这位委托人，因为阿伦德尔小姐已经去世了……"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/879/22289879/t6_22289879.jpg",
            "text": "H庄园的午餐",
            "link": "https://weread.qq.com/web/bookDetail/4d132e7071541dd74d17518?",
            "description": "阿加莎·克里斯蒂<br>年轻美丽的埃莉诺·卡莱尔平静地站在被告席上。她是H庄园女主人韦尔曼太太的侄女，被控谋杀了她的情敌——H庄园门房的女儿玛丽·杰拉德。证据确凿：埃莉诺准备了那份致命的午餐，也只有她拥有作案动机和时机。然而，在这个充满敌意的法庭上，只有一个人依然认为埃莉诺直到被证明有罪之前是清白的。赫尔克里·波洛挡在了埃莉诺和绞刑台之间……"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/95/yuewen_728525/t6_yuewen_7285251680854036.jpg",
            "text": "谋杀启事",
            "link": "https://weread.qq.com/web/bookDetail/34432bc05b1dcd344e8ff5e?",
            "description": "阿加莎·克里斯蒂<br>在一个平凡的小村镇，生活着一群普通的英国人。这个周五，百无聊赖的小镇居民纷纷被报上的一则谋杀启事吸引。它预告今天晚上，在老小姐莱蒂西亚家将有一场神秘的谋杀。傍晚时分，好奇的人们聚在女主人家。六点半的钟声响起，灯忽然熄灭。 “砰”、“砰”——“砰”，枪声响了。游戏结束，谋杀开始。"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/54/YueWen_728520/t6_YueWen_728520.jpg",
            "text": "破镜谋杀案",
            "link": "https://weread.qq.com/web/bookDetail/fc532f305b1dc8fc5b05c05?",
            "description": "阿加莎·克里斯蒂<br>美丽动人、在影视圈里风生水起大半辈子的大明星玛丽娜搬进了马普尔小姐所在的乡村小镇。风韵犹存的女明星举办盛大派对宴请小镇居民，每位来客都热情地上前攀谈，然而原本谈笑风生的女主人突然望着虚空中的一点，表情仿佛凝固了一般。这一奇异的画面被几位细心的客人捕捉到，事后众说纷纭，唯一相似的说法是，大家都觉得女主人那时如同看到了噩运。果然，不久后噩运降临，富丽堂换的女星豪宅迎来一连串凶杀……"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/642/852642/t6_852642.jpg",
            "text": "蒙面女人",
            "link": "https://weread.qq.com/web/bookDetail/638320d05d02a2638217a3f?",
            "description": "阿加莎·克里斯蒂<br>黑斯廷斯上尉认为，在波洛早期的侦探生涯中，有十八起案件值得拿出来与大家共赏。这些疑案花招百出：易容、诈骗、自编自导、嫁祸、双簧戏等等。不过，波洛依旧一副自信满满的模样，似乎天下没有他破不了的案子。“好好用用你那“小小的灰色细胞”，我的朋友，答案就在眼皮底下。”"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/29/YueWen_728516/t6_YueWen_728516.jpg",
            "text": "死亡约会",
            "link": "https://weread.qq.com/web/bookDetail/5f2320105b1dc45f21f5caf?",
            "description": "阿加莎·克里斯蒂<br>肥胖、邪恶的博因顿老夫人是家族的暴君。她就像一只盘踞在网中的蜘蛛，把几位儿女死死地困在身边，不让他们和外界接触，并以此为乐。每个人都对她厌憎无比，却又无力摆脱。古怪的博因顿一家来到约旦。炎热的一天，在佩特拉迷人的玫瑰色峭壁上，博因顿老夫人像尊怪异的佛像一般端坐不动——她死了。只是，她的手腕上留有一个微小的针孔，那是她被注射过致命一针的唯一迹象。这一次，留给波洛解谜的时间，只有二十四小时。"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/2/YueWen_852630/t6_YueWen_852630.jpg",
            "text": "波洛圣诞探案记",
            "link": "https://weread.qq.com/web/bookDetail/115323905d029611562436f?",
            "description": "阿加莎·克里斯蒂<br>对于自己在南非的发家之路以及手边留有一堆未经切割的钻石，老西米恩·李一直引以为傲，更不用说他哄起女人来确实有一手。可到了风烛残年的岁数，他在病痛中唯一想到的消遣方式，便是借着过圣诞节的机会，把四散各处的儿子们叫回身边，挨个儿数落。当然，他也没忘了提及修改遗嘱——挑起家人之间的猜忌是多么有趣的事！圣诞前夜，李家笼罩在不祥的气氛中，一声惨叫，老西米恩死在自己的卧室中。呈密室状态的现场，家里每个人都有作案的可能，面对如此棘手的案子，大侦探波洛也不得不度过一个并不轻松的圣诞节了……"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/3/yuewen_852653/t6_yuewen_8526531693465129.jpg",
            "text": "万圣节前夜的谋杀：电影《威尼斯惊魂夜》原著丨杨紫琼主演",
            "link": "https://weread.qq.com/web/bookDetail/3a0321405d02ad3a07da450?",
            "description": "阿加莎·克里斯蒂<br>万圣节前夜的派对上，十三岁女孩儿乔伊斯声称自己曾目睹过一场谋杀，但大家只当她是为了引人关注编的瞎话，无人当真。然而当晚，乔伊斯便被溺死在了咬苹果游戏的水桶里。赫尔克里·波洛受邀前来破案，众人的说法各异、真假难辨，唯一达成一致的是：所有人都认定乔伊斯在撒谎。那她为何会因为一句谎话而被杀呢？"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/55/YueWen_728521/t6_YueWen_728521.jpg",
            "text": "空幻之屋",
            "link": "https://weread.qq.com/web/bookDetail/4c932a105b1dc94c937f9cd?",
            "description": "阿加莎·克里斯蒂<br>热情的安格卡特尔夫妇照例在空幻庄园招待宾客共度周末。客人们从四面八方赶来，有的满心期待，有的尴尬赴约，有的肩负重任，有的迷惑忐忑……各怀心事的客人已是一团乱麻，没想到又迎来了一位不速之客——知名女影星维罗妮卡，她曾与前来度周末的已婚医生有过一段情事。空幻庄园瞬间掀起情感风暴，身处风暴中心的约翰倒毙在游泳池边，案情明了，线索丰富。可就是这样一场简单谋杀，几乎搅晕了波洛的大脑，看似热闹的空幻庄园似乎吸走了所有人的鲜活情感……"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/4/YueWen_852669/t6_YueWen_852669.jpg",
            "text": "蓝色列车之谜",
            "link": "https://weread.qq.com/web/bookDetail/6d032cf05d02bd6d080115e?",
            "description": "阿加莎·克里斯蒂<br>在一辆开往法国尼斯的蓝色列车上，富家女露丝·凯特林惨遭杀害，随身的稀世宝石“火焰之心”不知所踪。女仆提供的线索表明，露丝被杀前曾与一个高个子男人在一起。神秘的列车，离心的丈夫，贪婪的情人，虚幻的爱情，地中海旖旎风光下隐藏的恶意蠢蠢欲动。为查明真相，波洛再乘蓝色特快列车，最后终于发现一切均是谎言……"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/185/732185/t6_732185.jpg",
            "text": "藏书室女尸之谜",
            "link": "https://weread.qq.com/web/bookDetail/74e325805b2c1974e7d1402?",
            "description": "阿加莎·克里斯蒂<br>戈辛顿是一幢典型的贵族宅邸，主人是当地德高望重的人物，直到……他们家古色古香的藏书室里出现了一具美艳的女尸！谋杀案打破了英国小村的宁静。流言四起，班特里上校这个出了名的老实人一下子陷入最不堪的丑闻。班特里夫人决心捍卫丈夫的名誉，请来了好友马普尔小姐。英国刑警查出了被害人的身份——一家酒店的舞女，即将被富商收养，并得到一大笔财富。此时出现的另一起谋杀案让案情更加扑朔迷离。这一次，熟知人性和谎言的马普尔小姐找出了最关键的一点——作案动机……"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/18/YueWen_728498/t6_YueWen_728498.jpg",
            "text": "云中命案",
            "link": "https://weread.qq.com/web/bookDetail/72d324005b1db272d899669?",
            "description": "阿加莎·克里斯蒂<br>飞往巴黎的普罗米修斯航班上，波洛正在为晕机的毛病烦恼，一位漂亮女孩正倾心于对面坐着的英俊青年，一位医生在吹长笛，两位考古学家在热烈地讨论学术问题，一位伯爵夫人则和自己的情敌虚情假意地寒暄……然而谁都没有注意到，二号座位上那位上了年纪的法国女人，已经在不知不觉中被一只神秘的手夺去了生命，脚边落着一根只有在小说中才会出现的毒针……"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/57/YueWen_728523/t6_YueWen_728523.jpg",
            "text": "葬礼之后",
            "link": "https://weread.qq.com/web/bookDetail/968322d05b1dcb968dddaa1?",
            "description": "阿加莎·克里斯蒂<br>理查德·阿伯内西在死前留下了一大笔财产。在他的葬礼之后，他的妹妹、行为举止总是颇为奇怪的科拉小姐竟说了这样的话——“可他是被谋杀的，不是吗？”次日，科拉在家中的床上惨遭杀害。六个遗产受益人均有作案动机，每个人都恰巧没有不在场证明！这桩“有趣”的案件令波洛陷入窘境……他能否从和家族成员的对话中抽丝剥茧并发现蛛丝马迹？迷雾重重，真相直到故事最后才被揭开！"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/891/22289891/t6_22289891.jpg",
            "text": "复仇女神",
            "link": "https://weread.qq.com/web/bookDetail/95b3257071541de395b4ff1?",
            "description": "阿加莎·克里斯蒂<br>过着安宁的老年生活的马普尔小姐突然收到一封信，一位老朋友愿赠予她一笔数额巨大的遗产，前提是她为他做一件事。然而信中并没说具体是什么事，只把此次行动称为“复仇女神”。马普尔小姐在毫不知情的情况下开始了这位朋友为她准备的“旅行”，她确信这项任务与犯罪有关，于是，她要先“发现罪行”。她必须怀疑每个人、每件事，而这趟意外频发的破案之旅，看起来越来越危险了……"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/13/YueWen_22289899/t6_YueWen_22289899.jpg",
            "text": "控方证人（同名电影原著）",
            "link": "https://weread.qq.com/web/bookDetail/e6432fb071541debe64ac0e?",
            "description": "阿加莎·克里斯蒂<br>伦纳德·沃尔被控谋杀富婆艾米丽以图染指其巨额遗产，他却一再表明自己的无辜。伦纳德的妻子是唯一能够证明他无罪的证人，却以控方证人的身份出庭指证其确实犯有谋杀罪。伦纳德几乎陷入绝境，直到一个神秘女人的出现……墙上的犬形图案；召唤死亡的收音机；蓝色瓷罐的秘密；一只疯狂的灰猫……十一篇神秘的怪谈，最可怕的不是“幽灵”，而是你心中的魔鬼。"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/24/YueWen_728511/t6_YueWen_728511.jpg",
            "text": "怪屋",
            "link": "https://weread.qq.com/web/bookDetail/406324c05b1dbf406d850ae?",
            "description": "阿加莎·克里斯蒂<br>青年外交官查尔斯与美丽的索菲娅相爱，两人约定在二战结束后成婚。战后，查尔斯回到英国，听到的第一个消息便是索菲娅的爷爷——富商利奥尼迪斯在家中被人毒杀。查尔斯试图从住在这幢怪屋里的十一个人中找出凶手，未婚妻却对他说：“我们是一个怪异的大家庭，所有人都冷酷无情——但这种冷酷是以不同的形式表现出来的。这就是麻烦所在，让人看不清真相……”"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/517/728517/t6_728517.jpg",
            "text": "沉睡谋杀案",
            "link": "https://weread.qq.com/web/bookDetail/7fc328405b1dc57fca4bfdd?",
            "description": "阿加莎·克里斯蒂<br>新婚的格温达搬进了海边的一幢白色别墅。她兴致勃勃地布置自己的新家，一桩桩怪事却接连发生。“难道，这房子闹鬼？”种种线索显示，作祟的不是鬼魂，而是多年前发生的一起谋杀案。格温达向马普尔小姐求助，得到的忠告却是“让沉睡的谋杀案继续沉睡”。可好奇的年轻人不甘心停止追查。终于，过去的罪恶苏醒，即将写下新的悲剧……"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/526/728526/t6_728526.jpg",
            "text": "长夜",
            "link": "https://weread.qq.com/web/bookDetail/089326905b1dce08935624b?",
            "description": "阿加莎·克里斯蒂<br>美丽宁静的吉卜赛庄，却被传言是一所遭受了诅咒的住所，许多擅自进入的人都会在事故中丧生，没有人能够逃脱。然而英俊潇洒的穷小子迈克还是一眼看中了这里，奢望成为这里的主人。他与富家小姐艾丽在这里相遇、相爱，不久后便结婚、定居。他相信自己已经拥有了世界上最美好的一切，可那可怕的诅咒会放过他们吗？有一天，艾丽骑马出去，再也没有回来……"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/61/YueWen_24139758/t6_YueWen_24139758.jpg",
            "text": "伯特伦旅馆",
            "link": "https://weread.qq.com/web/bookDetail/97132830717057ee971f619?",
            "description": "阿加莎·克里斯蒂<br>“我真的想去伯特伦旅馆——在伦敦。”为了重温儿时回忆，马普尔小姐来到了伦敦的伯特伦旅馆，进门的一瞬间，简直就像回到了爱德华时代的英格兰：温暖的壁炉，优雅的侍者，完美的下午茶。就在这样一座旅馆，心不在焉的教士，素未谋面的母女，与周围环境格格不入的赛车手，还有马普尔小姐齐聚一堂。而随着教士的失踪，伯特伦完美的表象也逐渐剥离，露出了原本斑驳的面目……"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/503/728503/t6_728503.jpg",
            "text": "古墓之谜",
            "link": "https://weread.qq.com/web/bookDetail/4eb326705b1db74eb5eaa18?",
            "description": "阿加莎·克里斯蒂<br>护士艾米·莱瑟兰接受考古学家莱德纳博士的聘用，来到哈沙尼的挖掘场，照顾莱德纳博士美丽而神经质的妻子。不知为什么，所有人都觉得考古队里的气氛越来越奇怪，这真的是因为莱德纳太太不断产生的被害妄想吗？至少有一个人知道那不是妄想，因为在一个风和日丽的下午，莱德纳太太真的陈尸于窗户紧锁的房间中……"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/903/22289903/t6_22289903.jpg",
            "text": "山核桃大街谋杀案",
            "link": "https://weread.qq.com/web/bookDetail/17532d0071541def175b3ca?",
            "description": "阿加莎·克里斯蒂<br>山核桃大街上有一所留学生宿舍，这里住着肤色不同、性格迥异的男男女女，相处还算和睦。只是近来，接连发生诡异的失窃事件，丢失的都是不太值钱的东西，比如灯泡、姑娘用的口红、一只鞋子之类的。女管家哈伯德太太没太在意，直到有一个姑娘的毕业论文被人泼了墨水，她才觉得此事暗藏恶意，必须严肃对待。哈伯德太太找来波洛调查，波洛在宿舍里提议“报警”，此言一出，当晚便有人“自首”。然而自首的姑娘第二天都死了，并被拙劣地伪装成自杀。凶案将警察引来了山核桃大街，更疯狂的凶杀也接踵而至。残忍的真凶真的是涉世未深的学生之一吗？"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/91/YueWen_22289905/t6_YueWen_22289905.jpg",
            "text": "四魔头",
            "link": "https://weread.qq.com/web/bookDetail/85d328f071541df185dd4fd?",
            "description": "阿加莎·克里斯蒂<br>举世闻名的名侦探波洛遇到了最强劲的对手！他们是一个团队，四个人，身份不明且各自身怀绝技。仿如福尔摩斯遭遇莫里亚蒂，波洛这次也要与他们一决雌雄！然而在忠实的黑斯廷斯看来，年迈的波洛步步失策，似乎败局已定。从伦敦到巴黎，再到神秘的东方，波洛是被“四魔头”牵着鼻子走，还是一切尽在掌握？"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/766/24139766/t6_24139766.jpg",
            "text": "黑麦奇案",
            "link": "https://weread.qq.com/web/bookDetail/b36326c0717057f6b369ccc?",
            "description": "阿加莎·克里斯蒂<br>老弗特斯科先生的晚年生活相当不平静：生意上，他与大儿子的意见相左，财务安排上的失策令他损失不小；家庭中，小儿子远走海外多年，第二任妻子总是以打高尔夫球的名义与别的男人偷情，女儿也陷入不靠谱的恋情中；生活上，非洲采矿的经历让他结下了仇家，不时出现在他面前的黑画眉尸体暗示着复仇者的阴魂不散。终于，老弗特斯科被毒死在了自己的办公室。毒物紫杉碱似乎就出自他的宅邸“紫杉小筑”。接二连三的命案令弗特斯科一家人心惶惶，马普尔小姐发现，凶手竟是按照一首童谣行动的。"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/23/YueWen_24139778/t6_YueWen_24139778.jpg",
            "text": "幽巷谋杀案",
            "link": "https://weread.qq.com/web/bookDetail/7dc321c0717058027dc8300?",
            "description": "阿加莎·克里斯蒂<br>四个简单明快的探案故事。即将再婚的艾伦夫人一早被室友发现死于家中，看起来像是自杀但又疑点重重；一份重要的军事文件失窃，现场的两位绅士所言竟相互矛盾，更可疑的是案发时还有人声称看到了鬼；波洛受到邀请，傍晚时分来到一位贵族老爷的宅邸，可这位老爷却开枪自杀了，案发现场破碎的镜子让大侦探心生怀疑；希腊的著名度假小岛上发生了常见的三角恋，女人们议论纷纷，波洛却忧心忡忡。"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/27/YueWen_852671/t6_YueWen_852671.jpg",
            "text": "零点",
            "link": "https://weread.qq.com/web/bookDetail/e3e322d05d02bfe3ee33cd3?",
            "description": "阿加莎·克里斯蒂<br>一段变心与背叛的过往，两个性格完全不同的女人，三对陷入感情纠葛的年轻男女。在海鸥角的聚会上，从四面八方汇集而来的众人不约而同地感觉到悲剧的降临。谋杀其实早已开始，它默默无声地经历了起因、过程，并在某一特定时间、某一特定地点达到最高潮。谋杀本身就是故事的结局，是零点时刻。"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/7/YueWen_22289893/t6_YueWen_22289893.jpg",
            "text": "黑咖啡",
            "link": "https://weread.qq.com/web/bookDetail/9fa3280071541de59fabe9f?",
            "description": "阿加莎·克里斯蒂著 查尔斯·奥斯本改编<br>物理学家克劳德·艾默里爵士研究出了一个全新的方程式，预示着一种威力惊人的新型炸药即将诞生。然而，他那张写有方程式的纸片却在家里被盗了。克劳德爵士将全家人聚集在阅览室里，命令管家关上灯，希望窃贼能在黑暗中归还方程式，然而当灯光再次亮起时，他已然死去……这次，波洛不仅要破解这起谋杀案，而且必须阻止一场世界性的恐怖危机……"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/28/YueWen_852672/t6_YueWen_852672.jpg",
            "text": "马普尔小姐最后的案件",
            "link": "https://weread.qq.com/web/bookDetail/1e832d705d02c01e8e3d70a?",
            "description": "阿加莎·克里斯蒂<br>这是一部短篇小说集，内含九个故事。一个神秘男子带着枪伤晕倒在教堂；一位死去老人埋藏的宝藏谜团；一具死尸与一卷软尺；一个疯癫看门人引发的一次致命坠马事故；一位十全十美的女仆；一起密室“杀妻”案；一桩遗产继承谋杀案。七个精彩纷呈的故事，马普尔小姐依旧惊人的洞察力和推演能力！还有两起非马普尔探案系列的灵异案件：裁缝的洋娃娃与神秘的镜子，用惊悚片的效果直击人性。"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/2/YueWen_24058395/t6_YueWen_24058395.jpg",
            "text": "雪地上的女尸",
            "link": "https://weread.qq.com/web/bookDetail/58332420716f1a1b583a9c6?",
            "description": "阿加莎·克里斯蒂<br>这是阿加莎·克里斯蒂专为圣诞节准备的大餐。前菜：《梦境》和《弱者的愤怒》。神秘富翁近日来反复梦见自杀，他向多方求助但最终仍未逃出死亡的魔掌；一桩看似已了结的命案，死者的妻子却一口咬定真凶另有其人。主菜：《雪地上的女尸》和《西班牙箱子之谜》。波洛应大人物之邀前去追回王子失窃的宝石，却在做客的家庭里遭遇雪地命案；几位上流社会的男女们常常一起聚会，这一次狂欢过后，其中一位竟死在客厅的箱子里。还有饭后冰淇淋：《二十四只黑画眉》。年迈的亨利每周二和周四都去同一家餐厅吃晚餐，跌下自家楼梯那天他也去了，只不过点了完全不同的食物，波洛认为死亡的秘密就藏在黑莓派里。祝您有个好胃口。"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/17/YueWen_24058417/t6_YueWen_24058417.jpg",
            "text": "三只瞎老鼠",
            "link": "https://weread.qq.com/web/bookDetail/a8e32460716f1a31a8eff8f?",
            "description": "阿加莎·克里斯蒂<br>在一个风雪交加的日子，帕丁顿卡尔弗大街七十四号发生了一起谋杀案。凶手在死者身上留下了画着三只老鼠以及一小段《三只瞎老鼠》乐谱的信纸。在逃离现场时，凶手不小心从兜里掉出了一个笔记本，上面只记着两个地址：卡尔弗大街七十四号和蒙克斯维尔庄园。另一头，蒙克斯维尔庄园的新主人，戴维斯夫妇正为这处全新的家庭旅馆延揽顾客。当晚，四位奇怪的客人先后入住。恐怖的《三只瞎老鼠》曲调响起，凶手又要开始TA的捕鼠计划……"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/762/24139762/t6_24139762.jpg",
            "text": "怪钟疑案",
            "link": "https://weread.qq.com/web/bookDetail/bf632090717057f2bf6492c?",
            "description": "阿加莎·克里斯蒂<br>一间到处都是钟表的诡异房间，一具躺在地板上的无名男尸，一个失魂落魄的年轻女郎，一位双目失明的孤寡老妇，一条呈弯月形的奇特街道，一群各怀鬼胎的神秘住户……又一桩谋杀正在酝酿，时间一分一秒地流逝。这一次，伟大的侦探赫尔克里·波洛坐在轮椅上就锁定了凶手。"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/17/YueWen_24139772/t6_YueWen_24139772.jpg",
            "text": "闪光的氰化物",
            "link": "https://weread.qq.com/web/bookDetail/a29327a0717057fca299ef3?",
            "description": "阿加莎·克里斯蒂<br>罗斯玛丽，美好的名字。拥有这个名字的美丽少妇在生日宴会上惨死，警方认定为服用氰化物自杀。罗斯玛丽又有迷迭香的意思，而迷迭香的花语是爱的回忆。痛失爱妻的乔治一日都未曾忘记那一晚。一年过去了，他决定在同一天、同一家餐厅、同一张桌子、邀请同一批人，为亡妻罗斯玛丽祈福。当然，这只是表面借口。六个人围坐在七人的晚餐桌前，哪一个才是真凶？"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/94/YueWen_728502/t6_YueWen_728502.jpg",
            "text": "借镜杀人",
            "link": "https://weread.qq.com/web/bookDetail/226329505b1db6226c90485?",
            "description": "阿加莎·克里斯蒂<br>在《借镜杀人》一书中，卡莉·路易丝是个奇妙的女人。两任前夫让她坐拥豪宅，一辈子衣食无忧，现任丈夫虽然性情古怪，却毫无保留地爱着她。儿女绕膝、亲戚友善、仆从忠诚，甚至岁月都未在她脸上留下太多痕迹。这样的人生堪称完美，但她的老同学却觉得她身边环绕着不祥气息，甚至有死亡的征兆。"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/78/YueWen_22289885/t6_YueWen_22289885.jpg",
            "text": "大象的证词",
            "link": "https://weread.qq.com/web/bookDetail/ada3254071541dddadafc3f?",
            "description": "阿加莎·克里斯蒂<br>高贵美丽的夫人挽着年长的丈夫在悬崖边散步。第二天夫妻被发现双双陈尸崖底。这是一起自杀约定？还是蓄谋已久的谋杀？一场文学午宴，牵扯出一桩陈年旧案。大侦探波洛和奥利弗太太为了探明真相，踏上了寻找大象的旅程。据说，大象拥有绝佳的记忆力。无论时间如何流逝，大象不会忘记。"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/80/YueWen_22289887/t6_YueWen_22289887.jpg",
            "text": "犯罪团伙",
            "link": "https://weread.qq.com/web/bookDetail/38c32ab071541ddf38cf3f8?",
            "description": "阿加莎·克里斯蒂<br>汤米和塔彭丝·贝尔斯福德夫妇喜爱冒险，于是爽快地从苏格兰场手中接管了国际卓越侦探所，开门迎客。事实上，他们的秘密任务是特别留意那些贴着俄国邮票，且邮票背面写着数字十六的蓝色信件。更重要的是，如果有人来到办公室提及数字十六，必须立刻通知苏格兰场。汤米和塔彭丝轮番扮演著名侦探小说中的名侦探们，解决了一个又一个案子。只是那个代号十六的人却姗姗来迟。最终，出演大侦探波洛和搭档黑斯廷斯的汤米夫妇能否顺利地解决这最后一案？"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/82/YueWen_22289889/t6_YueWen_22289889.jpg",
            "text": "奉命谋杀",
            "link": "https://weread.qq.com/web/bookDetail/87b3207071541de187b4895?",
            "description": "阿加莎·克里斯蒂<br>卡尔加里博士在傍晚时分突然造访居住在艳阳角的阿盖尔一家，带来一个消息：涉嫌谋杀母亲并被定罪、最终惨死监狱中的小儿子杰克是被冤枉的。博士本人可以证实他的不在场证明。然而这迟来的正义却让一家人茫然，甚至惊恐。卡尔加里博士大惑不解，他觉得这个家里藏着些秘密。时至今日还能查出陈年旧案的真凶吗？而查出真凶真的是此事最好的解决方式吗……"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/21/YueWen_24139776/t6_YueWen_24139776.jpg",
            "text": "烟囱别墅之谜",
            "link": "https://weread.qq.com/web/bookDetail/53432d40717058005348cbb?",
            "description": "阿加莎·克里斯蒂<br>一本已故伯爵生前撰写的私密回忆录，一件失传已久的稀世珍宝，一位隐藏身份的王室继承人，一个热衷于暗杀的神秘组织，还有颇具邦德风范的、苏格兰场的巴特尔警长，以及来自法国和美国的秘密警察……各路人马轮番登场，所有扑朔迷离的线索交汇之后都指向命案发生的地方——烟囱别墅。"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/32/YueWen_25566754/t6_YueWen_25566754.jpg",
            "text": "悬崖上的谋杀",
            "link": "https://weread.qq.com/web/bookDetail/bf43221071861e22bf42c79?",
            "description": "阿加莎·克里斯蒂<br>博比·琼斯是个不着调的年轻人。一天，他在高尔夫球场发现有人跌落悬崖，赶过去时此人已经奄奄一息，挣扎着在死前留下了一句莫名其妙的话：“他们干嘛不找埃文斯呢？”博比没有多想，却在事后遭人谋杀未遂。回过神来，他的生活俨然成了一本刺激的侦探小说：危机暗藏的田园生活，新开的精神疗养院，邪恶的医生，吸食毒品的丈夫，角落里的丑闻……"
          },
          {
            "icon": "https://wfqqreader-1252317822.image.myqcloud.com/cover/496/728496/t6_728496.jpg",
            "text": "七面钟之谜",
            "link": "https://weread.qq.com/web/bookDetail/0f4325905b1db00f4c26a61?",
            "description": "阿加莎·克里斯蒂<br>几个年轻人来到这里度假，他们精心策划了一场恶作剧：用八只钟表吵醒那位似乎永远都会迟到的同伴。清晨，八只钟表依次响起，但这位可怜的同伴却再也无法苏醒。更令人吃惊的是，钟表居然只剩下了七只，有一只被扔出了窗外！紧接着，有一位同伴离奇死亡，而他的遗言竟然是：“七面钟……”“烟囱别墅”的主人邦德尔小姐决心找到真相。而那位在女王的作品中多次出现的、足以令人信任的巴特尔警官，似乎并不愿意帮助这位好奇的姑娘。"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/14/YueWen_23796537/t6_YueWen_23796537.jpg",
            "text": "捕鼠器",
            "link": "https://weread.qq.com/web/bookDetail/eb832a10716b1b39eb86b52?",
            "description": "阿加莎·克里斯蒂<br>《捕鼠器》讲述1948年冬天，在一个风雪交加的下午，伦敦西二区鸽子街二十四号发生了一起凶杀案。现场线索表明杀人犯已逃亡蒙克斯威尔。就在这个傍晚，在刚刚开业的蒙克斯威尔旅馆里，年轻的雷斯顿夫妇迎来了五位奇怪的客人，凶手在其中吗？危险还存在吗？次日下午，博可夏警察局的警官屈洛特也来到旅馆，他带来了更可怕的消息，风雪把所有人都困在了旅馆里,一场可怕的“杀人游戏”由此开始。"
          }
        ]
      },
      {
        text: '东野圭吾 作品集',
        items: [
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/27/3300020527/t6_3300020527.jpg",
            "text": "解忧杂货店",
            "link": "https://weread.qq.com/web/bookDetail/6d132250813ab6e84g017ca5",
            "description": "[日] 东野圭吾<br>东野圭吾当之无愧的长篇小说代表作。一本带给人无限温暖、安慰与感动的书。 东野圭吾特别寄语中国读者：“《解忧杂货店》能在中国拥有这么多读者，对我而言既是荣幸也是鼓励。我想在这本书中写的，是无论身处哪个国家、哪个时代的人都一定会抱有的‘梦想’与‘烦恼’。人之所以为人，正是因为这无尽的梦想与烦恼吧。” 我想再创作一部穿越的作品，但这次谁也不穿越。移动时空的不是人，而是信。如果可以和过去的人交换信件，自己要写些什么呢——这种想法成为创作《解忧杂货店》的契机。回顾写作过程，我发现自己始终在思考：站在人生的岔路口，人究竟应该怎么做？我希望读者能在掩卷时喃喃自语：我从未读过这样的小说。——东野圭吾"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/1/yuewen_230107/t6_yuewen_2301071682244014.jpg",
            "text": "白夜行",
            "link": "https://weread.qq.com/web/bookDetail/65032c105382db65050e7aa",
            "description": "[日] 东野圭吾<br>1999年，东野圭吾41岁正值盛年，写作出道已14年，在笔力、技巧、体力和雄心上都炉火纯青，于是洋洋洒洒写出了这部鸿篇巨制《白夜行》。这种规模宏大的长篇作品在职业作家一生的创作中极为罕见，完成后基本都被视为生涯代表作。《白夜行》一经推出即成为东野圭吾的长篇小说代表作，被万千书迷视为东野圭吾作品中的无冕之·王，畅销至今。《白夜行》中文版发行量超600万册，和《嫌疑人X的献身》《恶意》《解忧杂货店》并称为东野圭吾四大杰作。"
          },
          {
            "icon": "https://cdn.weread.qq.com/weread/cover/22/cpPlatform_kboEK7t9eX3aznMwkW7YVz/t6_cpPlatform_kboEK7t9eX3aznMwkW7YVz.jpg",
            "text": "虚无的十字架",
            "link": "https://weread.qq.com/web/bookDetail/dd832e80813ab74b7g017596",
            "description": "[日] 东野圭吾<br>《虚无的十字架》充满了东野圭吾对法理与人性的深切思考，将反转离奇的推理过程与思辨之力相结合，每一声拷问都钝重清晰、振聋发聩，却又如鲠在喉。  “回想那一天，我输入了约定好的传呼信息。不知过了多久，我在恍惚间听见了门把手转动的声音。我像蛇一样在地面爬行，耗尽了浑身的力气才抵达玄关。站在门口的是我蕞爱的人，也是我的同谋。我们一起掩埋了罪证。我想，做出了这么可怕的事，我这辈子都不会得到幸福了。那么，就用以后的人生来偿还吧。二十一年过去了。最近，我却觉得有谁在暗处盯着我。”"
          },
        ]
      }
    ]
  }
}